gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
//#############################################################################
//
// FILE:   epwm.h
//
// TITLE:   C28x EPWM Driver
//
//#############################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//#############################################################################

#ifndef __EPWM_H__
#define __EPWM_H__


//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup epwm_api
//! @{
//
//*****************************************************************************

//*****************************************************************************
// the includes
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_epwm.h"
#include "cpu.h"
#include "debug.h"
#include "interrupt.h"


// Time Base Module
//*****************************************************************************
//
// Values that can be passed to EPWM_setEmulationMode() as the
// emulationMode parameter
//
//*****************************************************************************
typedef enum
{
   //! Stop after next Time Base counter increment or decrement.
   EPWM_EMULATION_STOP_AFTER_NEXT_TB = 0,
   //! Stop when counter completes whole cycle
   EPWM_EMULATION_STOP_AFTER_FULL_CYCLE = 1,
   //! Free run
   EPWM_EMULATION_FREE_RUN = 2
}EPWM_EmulationMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setCountModeAfterSync() as the
// mode parameter
//
//*****************************************************************************
typedef enum
{
   EPWM_COUNT_MODE_DOWN_AFTER_SYNC = 0, //!< Count down after sync event
   EPWM_COUNT_MODE_UP_AFTER_SYNC = 1    //!< Count up after sync event
}EPWM_SyncCountMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setClockPrescaler() as the
// prescaler and highSpeedPrescaler parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_CLOCK_DIVIDER_1 = 0,     //!< Divide clock by 1
    EPWM_CLOCK_DIVIDER_2 = 1,     //!< Divide clock by 2
    EPWM_CLOCK_DIVIDER_4 = 2,     //!< Divide clock by 4
    EPWM_CLOCK_DIVIDER_8 = 3,     //!< Divide clock by 8
    EPWM_CLOCK_DIVIDER_16 = 4,    //!< Divide clock by 16
    EPWM_CLOCK_DIVIDER_32 = 5,    //!< Divide clock by 32
    EPWM_CLOCK_DIVIDER_64 = 6,    //!< Divide clock by 64
    EPWM_CLOCK_DIVIDER_128 = 7    //!< Divide clock by 128
}EPWM_ClockDivider;

//*****************************************************************************
//
// Values that can be passed to EPWM_setSyncOutPulseMode() as the mode
// parameter
//
//*****************************************************************************
typedef enum
{
    //! sync pulse is generated by software or by EPWMxSYNCI
    EPWM_SYNC_OUT_PULSE_ON_SOFTWARE  = 0,
    //! sync pulse is generated when time base counter equals zero
    EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO = 1,
    //! sync pulse is generated when time base counter equals compare B value.
    EPWM_SYNC_OUT_PULSE_ON_COUNTER_COMPARE_B = 2,
    //! sync pulse is disabled
    EPWM_SYNC_OUT_PULSE_DISABLED = 4,
    //! sync pulse is generated when time base counter equals compare D value.
    EPWM_SYNC_OUT_PULSE_ON_COUNTER_COMPARE_C = 5,
    //! sync pulse is disabled.
    EPWM_SYNC_OUT_PULSE_ON_COUNTER_COMPARE_D = 6
}EPWM_SyncOutPulseMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setPeriodLoadMode()  as the
// loadMode parameter
//
//*****************************************************************************
typedef enum
{
    //! PWM Period register access is through shadow register
    EPWM_PERIOD_SHADOW_LOAD = 0,
    //! PWM Period register access is directly
    EPWM_PERIOD_DIRECT_LOAD = 1
}EPWM_PeriodLoadMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setTimeBaseCounterMode()  as the
// counterMode parameter
//
//*****************************************************************************
typedef enum
{
    EPWM_COUNTER_MODE_UP = 0,         //!< Up - count mode.
    EPWM_COUNTER_MODE_DOWN = 1,       //!< Down - count mode.
    EPWM_COUNTER_MODE_UP_DOWN = 2,    //!< Up - down - count mode.
    EPWM_COUNTER_MODE_STOP_FREEZE = 3 //!< Stop - Freeze counter.
}EPWM_TimeBaseCountMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_selectPeriodLoadEvent()  as the
// shadowLoadMode parameter
//
//*****************************************************************************
typedef enum
{
    //! shadow to active load occurs when time base counter reaches 0.
    EPWM_SHADOW_LOAD_MODE_COUNTER_ZERO = 0,
    //! shadow to active load occurs when time base counter reaches 0 and a
    //! SYNC occurs
    EPWM_SHADOW_LOAD_MODE_COUNTER_SYNC = 1,
    //! shadow to active load occurs only when a SYNC occurs
    EPWM_SHADOW_LOAD_MODE_SYNC         = 2
}EPWM_PeriodShadowLoadMode;

//*****************************************************************************
//
// Values that can be returned by the EPWM_getTimeBaseCounterDirection()
//
//
//*****************************************************************************
//! Time base counter is counting up
#define EPWM_TIME_BASE_STATUS_COUNT_UP                1U
//! Time base counter is counting down
#define EPWM_TIME_BASE_STATUS_COUNT_DOWN              0U

//*****************************************************************************
//
// Values that can be passed to the EPWM_setupEPWMLinks()  as epwmLink
// parameter
//
//*****************************************************************************
typedef enum
{
    EPWM_LINK_WITH_EPWM_1 = 0,   //!< link current ePWM with ePWM1
    EPWM_LINK_WITH_EPWM_2 = 1,   //!< link current ePWM with ePWM2
    EPWM_LINK_WITH_EPWM_3 = 2,   //!< link current ePWM with ePWM3
    EPWM_LINK_WITH_EPWM_4 = 3,   //!< link current ePWM with ePWM4
    EPWM_LINK_WITH_EPWM_5 = 4,   //!< link current ePWM with ePWM5
    EPWM_LINK_WITH_EPWM_6 = 5,   //!< link current ePWM with ePWM6
    EPWM_LINK_WITH_EPWM_7 = 6,   //!< link current ePWM with ePWM7
    EPWM_LINK_WITH_EPWM_8 = 7    //!< link current ePWM with ePWM8
}EPWM_Link;

//*****************************************************************************
//
// Values that can be passed to the EPWM_setupEPWMLinks() as linkComp
// parameter
//
//*****************************************************************************
typedef enum
{
    EPWM_LINK_TBPRD   = 0,  //!< link TBPRD:TBPRDHR registers
    EPWM_LINK_COMP_A  = 4,  //!< link COMPA registers
    EPWM_LINK_COMP_B  = 8,  //!< link COMPB registers
    EPWM_LINK_COMP_C  = 12, //!< link COMPC registers
    EPWM_LINK_COMP_D  = 16, //!< link COMPD registers
    EPWM_LINK_GLVCTL2 = 28  //!< link GLDCTL2 registers
}EPWM_LinkComponent;

// Counter Compare Module
//*****************************************************************************
//
// Values that can be passed to the EPWM_getCounterCompareShadowStatus(),
// EPWM_setCounterCompareValue(), EPWM_setCounterCompareShadowLoadMode()
// as compModule parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_COUNTER_COMPARE_A = 0, //!< counter compare A
    EPWM_COUNTER_COMPARE_B = 2, //!< counter compare B
    EPWM_COUNTER_COMPARE_C = 5, //!< counter compare C
    EPWM_COUNTER_COMPARE_D = 7  //!< counter compare D
}EPWM_CounterCompareModule;

//*****************************************************************************
//
// Values that can be passed to EPWM_setCounterCompareShadowLoadMode() as the
// loadMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    EPWM_COMP_LOAD_ON_CNTER_ZERO = 0,
    //! load when counter equals period
    EPWM_COMP_LOAD_ON_CNTER_PERIOD = 1,
    //! load when counter equals zero or period
    EPWM_COMP_LOAD_ON_CNTER_ZERO_PERIOD = 2,
    //! Freeze shadow to active load
    EPWM_COMP_LOAD_FREEZE = 3,
    //! load when counter equals zero
    EPWM_COMP_LOAD_ON_SYNC_CNTER_ZERO = 4,
    //! load when counter equals period
    EPWM_COMP_LOAD_ON_SYNC_CNTER_PERIOD = 5,
    //! load when counter equals zero or period
    EPWM_COMP_LOAD_ON_SYNC_CNTER_ZERO_PERIOD = 6,
    //! load on sync only
    EPWM_COMP_LOAD_ON_SYNC_ONLY = 8
}EPWM_CounterCompareLoadMode;

// Action Qualifier Module
//*****************************************************************************
//
// Values that can be passed to the EPWM_setActionQualifierShadowLoadMode()
// as the aqModule parameter
//
//*****************************************************************************
typedef enum
{
    EPWM_ACTION_QUALIFIER_A = 0, //!< Action Qualifier A
    EPWM_ACTION_QUALIFIER_B = 2  //!< Action Qualifier B
}EPWM_ActionQualifierModule;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierShadowLoadMode() as the
// loadMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    EPWM_AQ_LOAD_ON_CNTER_ZERO = 0,
    //! load when counter equals period
    EPWM_AQ_LOAD_ON_CNTER_PERIOD = 1,
    //! load when counter equals zero or period
    EPWM_AQ_LOAD_ON_CNTER_ZERO_PERIOD = 2,
    //! Freeze shadow to active load
    EPWM_AQ_LOAD_FREEZE = 3,
    //! load when counter equals zero
    EPWM_AQ_LOAD_ON_SYNC_CNTER_ZERO = 4,
    //! load when counter equals period
    EPWM_AQ_LOAD_ON_SYNC_CNTER_PERIOD = 5,
    //! load when counter equals zero or period
    EPWM_AQ_LOAD_ON_SYNC_CNTER_ZERO_PERIOD = 6,
    //! load on sync only
    EPWM_AQ_LOAD_ON_SYNC_ONLY = 8
}EPWM_ActionQualifierLoadMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierT2TriggerSource() and
// EPWM_setActionQualifierT2TriggerSource() as the trigger parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_1 = 0,      //!< Digital compare event A 1
    EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_2 = 1,      //!< Digital compare event A 2
    EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_1 = 2,      //!< Digital compare event B 1
    EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_2 = 3,      //!< Digital compare event B 2
    EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_1  = 4,      //!< Trip zone 1
    EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_2  = 5,      //!< Trip zone 2
    EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_3  = 6,      //!< Trip zone 3
    EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN = 7 //!< ePWM sync
}EPWM_ActionQualifierTriggerSource;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierAction() as the event
// parameter.
//
//*****************************************************************************
typedef enum
{
    //! Time base counter equals zero
    EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO       = 0,
    //! Time base counter equals period
    EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD     = 2,
    //! Time base counter up equals COMPA
    EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA    = 4,
    //! Time base counter down equals COMPA
    EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA  = 6,
    //! Time base counter up equals COMPB
    EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB    = 8,
    //! Time base counter down equals COMPB
    EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB  = 10,
    //! T1 event on count up
    EPWM_AQ_OUTPUT_ON_T1_COUNT_UP         = 1,
    //! T1 event on count down
    EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN       = 3,
    //! T2 event on count up
    EPWM_AQ_OUTPUT_ON_T2_COUNT_UP         = 5,
    //! T2 event on count down
    EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN       = 7
}EPWM_ActionQualifierOutputEvent;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierSwAction(),
// EPWM_setActionQualifierContSWForceAction(), EPWM_setActionQualifierAction()
// as the outPut parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_AQ_OUTPUT_NO_CHANGE = 0,  //!< No change in the output pins
    EPWM_AQ_OUTPUT_LOW       = 1,  //!< Set output pins to low
    EPWM_AQ_OUTPUT_HIGH      = 2,  //!< Set output pins to High
    EPWM_AQ_OUTPUT_TOGGLE    = 3   //!< Toggle the output pins
}EPWM_ActionQualifierOutput;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierContSWForceAction(),
//  as the outPut parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_AQ_SW_DISABLED         = 0,  //!< Software forcing disabled
    EPWM_AQ_SW_OUTPUT_LOW       = 1,  //!< Set output pins to low
    EPWM_AQ_SW_OUTPUT_HIGH      = 2   //!< Set output pins to High
}EPWM_ActionQualifierSWOutput;

//*****************************************************************************
//
// Values that can be passed to EPWM_forceActionQualifierSwAction() ,
// EPWM_setActionQualifierSwAction(),EPWM_setActionQualifierContSWForceAction()
// EPWM_setActionQualifierAction() as epwmOutput parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_AQ_OUTPUT_A = 0, //!< ePWMxA output
    EPWM_AQ_OUTPUT_B = 2  //!< ePWMxB output
}EPWM_ActionQualifierOutputModule;

//*****************************************************************************
//
// Values that can be passed to EPWM_setActionQualifierContSWForceShadowMode()
// as the mode parameter.
//
//*****************************************************************************
typedef enum
{
    //! shadow mode load when counter equals zero
    EPWM_AQ_SW_SH_LOAD_ON_CNTER_ZERO        = 0,
    //! shadow mode load when counter equals period
    EPWM_AQ_SW_SH_LOAD_ON_CNTER_PERIOD      = 1,
    //! shadow mode load when counter equals zero or period
    EPWM_AQ_SW_SH_LOAD_ON_CNTER_ZERO_PERIOD = 2
}EPWM_ActionQualifierContForce;

//*****************************************************************************
//
// Values that can be passed to the EPWM_setDeadBandOutputSwapMode()
// as the output parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DB_OUTPUT_A = 0, //!< DB output is ePWMA
    EPWM_DB_OUTPUT_B = 1  //!< DB output is ePWMB
}EPWM_DeadBandOutput;

//*****************************************************************************
//
// Values that can be passed to the EPWM_setDeadBandDelayPolarity(),
// EPWM_setDeadBandDelayMode() as the delayMode parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DB_RED = 1, //!< DB RED (Rising Edge Delay) mode
    EPWM_DB_FED = 0  //!< DB FED (Falling Edge Delay) mode
}EPWM_DeadBandDelayMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setDeadBandDelayPolarity as the
// polarity parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DB_POLARITY_ACTIVE_HIGH = 0, //!< DB polarity is not inverted
    EPWM_DB_POLARITY_ACTIVE_LOW  = 1  //!< DB polarity is inverted
}EPWM_DeadBandPolarity;

//*****************************************************************************
//
// Values that can be passed to the EPWM_setRisingEdgeDeadBandDelayInput(),
// EPWM_setFallingEdgeDeadBandDelayInput() s as the input parameter.
//
//*****************************************************************************
//! Input signal is ePWMA
#define EPWM_DB_INPUT_EPWMA       0U
//! Input signal is ePWMA
#define EPWM_DB_INPUT_EPWMB       1U
//! Input signal is the output of Rising Edge delay
#define EPWM_DB_INPUT_DB_RED      2U

//*****************************************************************************
//
// Values that can be passed to and EPWM_setDeadBandControlShadowLoadMode() as
// the loadMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    EPWM_DB_LOAD_ON_CNTER_ZERO        = 0,
    //! load when counter equals period
    EPWM_DB_LOAD_ON_CNTER_PERIOD      = 1,
    //! load when counter equals zero or period
    EPWM_DB_LOAD_ON_CNTER_ZERO_PERIOD = 2,
    //! Freeze shadow to active load
    EPWM_DB_LOAD_FREEZE = 3
}EPWM_DeadBandControlLoadMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setRisingEdgeDelayCountShadowLoadMode()
// as the loadMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    EPWM_RED_LOAD_ON_CNTER_ZERO        = 0,
    //! load when counter equals period
    EPWM_RED_LOAD_ON_CNTER_PERIOD      = 1,
    //! load when counter equals zero or period
    EPWM_RED_LOAD_ON_CNTER_ZERO_PERIOD = 2,
    //! Freeze shadow to active load
    EPWM_RED_LOAD_FREEZE = 3
}EPWM_RisingEdgeDelayLoadMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_setFallingEdgeDelayCountShadowLoadMode()
// as the loadMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    EPWM_FED_LOAD_ON_CNTER_ZERO        = 0,
    //! load when counter equals period
    EPWM_FED_LOAD_ON_CNTER_PERIOD      = 1,
    //! load when counter equals zero or period
    EPWM_FED_LOAD_ON_CNTER_ZERO_PERIOD = 2,
    //! Freeze shadow to active load
    EPWM_FED_LOAD_FREEZE = 3
}EPWM_FallingEdgeDelayLoadMode;

//*****************************************************************************
//
// Values that can be passed to and EPWM_setDeadBandCounterClock() as the
// clockMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! Dead band counter runs at TBCLK rate
    EPWM_DB_COUNTER_CLOCK_FULL_CYCLE = 0,
    //! Dead band counter runs at 2*TBCLK rate
    EPWM_DB_COUNTER_CLOCK_HALF_CYCLE = 1
}EPWM_DeadBandClockMode;

// Trip Zone
//*****************************************************************************
//
// Values that can be passed to EPWM_enableTripZoneSignals() and
// EPWM_disableTripZoneSignals() as the tzSignal parameter.
//
//*****************************************************************************
#define EPWM_TZ_SIGNAL_CBC1          0x1U    //!< TZ1 Cycle By Cycle
#define EPWM_TZ_SIGNAL_CBC2          0x2U    //!< TZ2 Cycle By Cycle
#define EPWM_TZ_SIGNAL_CBC3          0x4U    //!< TZ3 Cycle By Cycle
#define EPWM_TZ_SIGNAL_CBC4          0x8U    //!< TZ4 Cycle By Cycle
#define EPWM_TZ_SIGNAL_CBC5          0x10U   //!< TZ5 Cycle By Cycle
#define EPWM_TZ_SIGNAL_CBC6          0x20U   //!< TZ6 Cycle By Cycle
#define EPWM_TZ_SIGNAL_DCAEVT2       0x40U   //!< DCAEVT2 Cycle By Cycle
#define EPWM_TZ_SIGNAL_DCBEVT2       0x80U   //!< DCBEVT2 Cycle By Cycle
#define EPWM_TZ_SIGNAL_OSHT1         0x100U  //!< One-shot TZ1
#define EPWM_TZ_SIGNAL_OSHT2         0x200U  //!< One-shot TZ2
#define EPWM_TZ_SIGNAL_OSHT3         0x400U  //!< One-shot TZ3
#define EPWM_TZ_SIGNAL_OSHT4         0x800U  //!< One-shot TZ4
#define EPWM_TZ_SIGNAL_OSHT5         0x1000U //!< One-shot TZ5
#define EPWM_TZ_SIGNAL_OSHT6         0x2000U //!< One-shot TZ6
#define EPWM_TZ_SIGNAL_DCAEVT1       0x4000U //!< One-shot DCAEVT1
#define EPWM_TZ_SIGNAL_DCBEVT1       0x8000U //!< One-shot DCBEVT1

//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneDigitalCompareEventCondition()
// as the dcType parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_TZ_DC_OUTPUT_A1 = 0, //!< Digital Compare output 1 A
    EPWM_TZ_DC_OUTPUT_A2 = 3, //!< Digital Compare output 2 A
    EPWM_TZ_DC_OUTPUT_B1 = 6, //!< Digital Compare output 1 B
    EPWM_TZ_DC_OUTPUT_B2 = 9  //!< Digital Compare output 2 B
}EPWM_TripZoneDigitalCompareOutput;
//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneDigitalCompareEventCondition()
// as the dcEvent parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_TZ_EVENT_DC_DISABLED = 0,       //!< Event is disabled
    EPWM_TZ_EVENT_DCXH_LOW    = 1,       //!< Event when DCxH low
    EPWM_TZ_EVENT_DCXH_HIGH   = 2,       //!< Event when DCxH high
    EPWM_TZ_EVENT_DCXL_LOW    = 3,       //!< Event when DCxL low
    EPWM_TZ_EVENT_DCXL_HIGH   = 4,       //!< Event when DCxL high
    EPWM_TZ_EVENT_DCXL_HIGH_DCXH_LOW = 5 //!< Event when DCxL high DCxH low
}EPWM_TripZoneDigitalCompareOutputEvent;
//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneAction() as the tzEvent
// parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_TZ_ACTION_EVENT_TZA = 0,     //!< TZ1 - TZ6 , DCAEVT2 , DCAEVT1
    EPWM_TZ_ACTION_EVENT_TZB = 2,     //!< TZ1 - TZ6 , DCBEVT2 , DCBEVT1
    EPWM_TZ_ACTION_EVENT_DCAEVT1 = 4, //!< DCAEVT1 (Digital Compare A event 1)
    EPWM_TZ_ACTION_EVENT_DCAEVT2 = 6, //!< DCAEVT2 (Digital Compare A event 2)
    EPWM_TZ_ACTION_EVENT_DCBEVT1 = 8, //!< DCBEVT1 (Digital Compare B event 1)
    EPWM_TZ_ACTION_EVENT_DCBEVT2 = 10 //!< DCBEVT2 (Digital Compare B event 2)
}EPWM_TripZoneEvent;
//*****************************************************************************
//
// Values that can be passed to and EPWM_setTripZoneAction() as the tzAction
// parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_TZ_ACTION_HIGH_Z  = 0, //!< high impedance output
    EPWM_TZ_ACTION_HIGH    = 1, //!< high voltage state
    EPWM_TZ_ACTION_LOW     = 2, //!< low voltage state
    EPWM_TZ_ACTION_DISABLE = 3  //!< disable action
}EPWM_TripZoneAction;
//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneAdvAction() as the tzAdvEvent
// parameter.
//
//*****************************************************************************
typedef enum
{
    //! TZ1 - TZ6 , DCBEVT2 , DCBEVT1 while counting down
    EPWM_TZ_ADV_ACTION_EVENT_TZB_D = 9,
    //! TZ1 - TZ6 , DCBEVT2 , DCBEVT1 while counting up
    EPWM_TZ_ADV_ACTION_EVENT_TZB_U = 6,
    //! TZ1 - TZ6 , DCAEVT2 , DCAEVT1 while counting down
    EPWM_TZ_ADV_ACTION_EVENT_TZA_D = 3,
    //! TZ1 - TZ6 , DCAEVT2 , DCAEVT1 while counting up
    EPWM_TZ_ADV_ACTION_EVENT_TZA_U = 0
}EPWM_TripZoneAdvancedEvent;

