gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneAdvDigitalCompareActionA() ,
// EPWM_setTripZoneAdvDigitalCompareActionB() and
// EPWM_setTZAdvAction() as the tzAdvDcAction parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_TZ_ADV_ACTION_HIGH_Z  = 0, //!< high impedance output
    EPWM_TZ_ADV_ACTION_HIGH    = 1, //!< high voltage state
    EPWM_TZ_ADV_ACTION_LOW     = 2, //!< low voltage state
    EPWM_TZ_ADV_ACTION_TOGGLE  = 3, //!< low voltage state
    EPWM_TZ_ADV_ACTION_DISABLE = 7  //!< disable action
}EPWM_TripZoneAdvancedAction;

//*****************************************************************************
//
// Values that can be passed to EPWM_setTripZoneAdvDigitalCompareActionA() and
// EPWM_setTripZoneAdvDigitalCompareActionB() as the tzAdvDcEvent parameter.
//
//*****************************************************************************
typedef enum
{
    //! Digital Compare event A/B 1 while counting up
    EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_U = 0,
    //! Digital Compare event A/B 1 while counting down
    EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_D = 3,
    //! Digital Compare event A/B 2 while counting up
    EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_U = 6,
    //! Digital Compare event A/B 2 while counting down
    EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_D =  9
}EPWM_TripZoneAdvDigitalComapreEvent;

//*****************************************************************************
//
// Values that can be passed to EPWM_enableTripZoneInterrupt()and
// EPWM_disableTripZoneInterrupt() as the tzInterrupt parameter.
// These values are also returned by the EPWM_getTripZoneInterruptStatus() .
//
//*****************************************************************************
//! Trip Zones Cycle By Cycle interrupt
#define EPWM_TZ_INTERRUPT_CBC      0x2U
//! Trip Zones One Shot interrupt
#define EPWM_TZ_INTERRUPT_OST      0x4U
//! Digital Compare A Event 1 interrupt
#define EPWM_TZ_INTERRUPT_DCAEVT1  0x8U
//! Digital Compare A Event 2 interrupt
#define EPWM_TZ_INTERRUPT_DCAEVT2  0x10U
//! Digital Compare B Event 1 interrupt
#define EPWM_TZ_INTERRUPT_DCBEVT1  0x20U
//! Digital Compare B Event 2 interrupt
#define EPWM_TZ_INTERRUPT_DCBEVT2  0x40U

//*****************************************************************************
//
// This value can be passed to EPWM_clearTripZoneInterruptFlag() as the
// tzInterrupt parameter. This value is returned by the
// EPWM_getTripZoneInterruptStatus()
//
//*****************************************************************************
//! Trip Zone interrupt
#define EPWM_TZ_INTERRUPT                              0x1U
//*****************************************************************************
//
// This values can be passed to EPWM_clearCycleByCycleTripZoneInterruptFlag()
// as the tzCbcInterrupt parameter.
// These values are returned by EPWM_getCycleByCycleTripZoneInterruptStatus().
//
//*****************************************************************************
//! CBC interrupt CBC1
#define EPWM_TZ_CBC_INTERRUPT_CBC1  0x1U
//! CBC interrupt CBC2
#define EPWM_TZ_CBC_INTERRUPT_CBC2  0x2U
//! CBC interrupt CBC3
#define EPWM_TZ_CBC_INTERRUPT_CBC3  0x4U
//! CBC interrupt CBC4
#define EPWM_TZ_CBC_INTERRUPT_CBC4  0x8U
//! CBC interrupt CBC5
#define EPWM_TZ_CBC_INTERRUPT_CBC5  0x10U
//! CBC interrupt CBC6
#define EPWM_TZ_CBC_INTERRUPT_CBC6   0x20U
//! CBC interrupt Digital compare event A2
#define EPWM_TZ_CBC_INTERRUPT_DCAEVT2  0x40U
//! CBC interrupt Digital compare event B2
#define EPWM_TZ_CBC_INTERRUPT_DCBEVT2  0x80U

//*****************************************************************************
//
// This values can be passed to EPWM_clearOneShotTripZoneInterruptFlag() as the
// tzCbcInterrupt parameter. These values are returned by the
// EPWM_getOneShotTripZoneInterruptStatus() .
//
//*****************************************************************************
//! OST interrupt CBC1
#define EPWM_TZ_OST_INTERRUPT_OST1  0x1U
//! OST interrupt CBC2
#define EPWM_TZ_OST_INTERRUPT_OST2  0x2U
//! OST interrupt CBC3
#define EPWM_TZ_OST_INTERRUPT_OST3  0x4U
//! OST interrupt CBC4
#define EPWM_TZ_OST_INTERRUPT_OST4  0x8U
//! OST interrupt CBC5
#define EPWM_TZ_OST_INTERRUPT_OST5  0x10U
//! OST interrupt CBC6
#define EPWM_TZ_OST_INTERRUPT_OST6  0x20U
//! OST interrupt Digital compare event A1
#define EPWM_TZ_OST_INTERRUPT_DCAEVT1   0x40U
//! OST interrupt Digital compare event B1
#define EPWM_TZ_OST_INTERRUPT_DCBEVT1   0x80U

//*****************************************************************************
//
// Values that can be passed to EPWM_selectCycleByCycleTripZoneClearEvent() as
// the clearMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! Clear CBC pulse when counter equals zero
    EPWM_TZ_CBC_PULSE_CLR_CNTR_ZERO = 0,
    //! Clear CBC pulse when counter equals period
    EPWM_TZ_CBC_PULSE_CLR_CNTR_PERIOD = 1,
    //! Clear CBC pulse when counter equals zero or period
    EPWM_TZ_CBC_PULSE_CLR_CNTR_ZERO_PERIOD = 2
}EPWM_CycleByCycleTripZoneClearMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_forceTripZoneEvent() as the
// tzForceEvent parameter.
//
//*****************************************************************************
#define EPWM_TZ_FORCE_EVENT_CBC  0x2U
#define EPWM_TZ_FORCE_EVENT_OST  0x4U
#define EPWM_TZ_FORCE_EVENT_DCAEVT1  0x8U
#define EPWM_TZ_FORCE_EVENT_DCAEVT2  0x10U
#define EPWM_TZ_FORCE_EVENT_DCBEVT1  0x20U
#define EPWM_TZ_FORCE_EVENT_DCBEVT2  0x40U

//*****************************************************************************
//
// Values that can be passed to EPWM_setInterruptSource() as the
// interruptSource parameter.
//
//*****************************************************************************
//! Time-base counter equal to zero
#define EPWM_INT_TBCTR_ZERO  1U
//! Time-base counter equal to period
#define EPWM_INT_TBCTR_PERIOD  2U
//! Time-base counter equal to zero or period
#define EPWM_INT_TBCTR_ZERO_OR_PERIOD  3U
//! time-base counter equal to CMPA when the timer is incrementing
#define EPWM_INT_TBCTR_U_CMPA  4U
//! time-base counter equal to CMPC when the timer is incrementing
#define EPWM_INT_TBCTR_U_CMPC  8U
//! time-base counter equal to CMPA when the timer is decrementing
#define EPWM_INT_TBCTR_D_CMPA  5U
//! time-base counter equal to CMPC when the timer is decrementing
#define EPWM_INT_TBCTR_D_CMPC  10U
//! time-base counter equal to CMPB when the timer is incrementing
#define EPWM_INT_TBCTR_U_CMPB  6U
//! time-base counter equal to CMPD when the timer is incrementing
#define EPWM_INT_TBCTR_U_CMPD  12U
//! time-base counter equal to CMPB when the timer is decrementing
#define EPWM_INT_TBCTR_D_CMPB  7U
//! time-base counter equal to CMPD when the timer is decrementing
#define EPWM_INT_TBCTR_D_CMPD  14U

//*****************************************************************************
//
// Values that can be passed to EPWM_enableADCTrigger() ,
// EPWM_disableADCTrigger(),EPWM_setADCTriggerSource(),
// EPWM_setADCTriggerEventPrescale(),EPWM_getADCTriggerFlagStatus(),
// EPWM_clearADCTriggerFlag(),EPWM_enableADCTriggerEventCountInit(),
// EPWM_disableADCTriggerEventCountInit(),EPWM_forceADCTriggerEventCountInit(),
// EPWM_setADCTriggerEventCountInitValue(),EPWM_getADCTriggerEventCount(),
// EPWM_forceADCTrigger() as the adcSocType parameter
//
//*****************************************************************************
typedef enum
{
    EPWM_SOC_A = 0,  //!< SOC A
    EPWM_SOC_B = 1   //!< SOC B
}EPWM_AdcStartOfConversionType;

//*****************************************************************************
//
// Values that can be passed to EPWM_setADCTriggerSource()  as the
// socSource parameter.
//
//*****************************************************************************
typedef enum
{
    //! Event is based on DCxEVT1
    EPWM_SOC_DCxEVT1 = 0,
    //! Time-base counter equal to zero
    EPWM_SOC_TBCTR_ZERO = 1,
    //! Time-base counter equal to period
    EPWM_SOC_TBCTR_PERIOD = 2,
    //! Time-base counter equal to zero or period
    EPWM_SOC_TBCTR_ZERO_OR_PERIOD = 3,
    //! time-base counter equal to CMPA when the timer is incrementing
    EPWM_SOC_TBCTR_U_CMPA = 4,
    //! time-base counter equal to CMPC when the timer is incrementing
    EPWM_SOC_TBCTR_U_CMPC = 8,
    //! time-base counter equal to CMPA when the timer is decrementing
    EPWM_SOC_TBCTR_D_CMPA = 5,
    //! time-base counter equal to CMPC when the timer is decrementing
    EPWM_SOC_TBCTR_D_CMPC = 10,
    //! time-base counter equal to CMPB when the timer is incrementing
    EPWM_SOC_TBCTR_U_CMPB = 6,
    //! time-base counter equal to CMPD when the timer is incrementing
    EPWM_SOC_TBCTR_U_CMPD = 12,
    //! time-base counter equal to CMPB when the timer is decrementing
    EPWM_SOC_TBCTR_D_CMPB = 7,
    //! time-base counter equal to CMPD when the timer is decrementing
    EPWM_SOC_TBCTR_D_CMPD = 14
}EPWM_AdcStartOfConversionSource;

// Digital Compare Module
//*****************************************************************************
//
// Values that can be passed to EPWM_selectDigitalCompareTripInput(),
// EPWM_enableDigitalCompareTripCombinationInput(),
// EPWM_disableDigitalCompareTripCombinationInput() as the dcType parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DC_TYPE_DCAH = 0,  //!< Digital Compare A High
    EPWM_DC_TYPE_DCAL = 1,  //!< Digital Compare A Low
    EPWM_DC_TYPE_DCBH = 2,  //!< Digital Compare B High
    EPWM_DC_TYPE_DCBL = 3   //!< Digital Compare B Low
}EPWM_DigitalCompareType;

//*****************************************************************************
//
// Values that can be passed to EPWM_selectDigitalCompareTripInput() as the
// tripSource parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DC_TRIP_TRIPIN1 = 0,   //!< Trip 1
    EPWM_DC_TRIP_TRIPIN2 = 1,   //!< Trip 2
    EPWM_DC_TRIP_TRIPIN3 = 2,   //!< Trip 3
    EPWM_DC_TRIP_TRIPIN4 = 3,   //!< Trip 4
    EPWM_DC_TRIP_TRIPIN5 = 4,   //!< Trip 5
    EPWM_DC_TRIP_TRIPIN6 = 5,   //!< Trip 6
    EPWM_DC_TRIP_TRIPIN7 = 6,   //!< Trip 7
    EPWM_DC_TRIP_TRIPIN8 = 7,   //!< Trip 8
    EPWM_DC_TRIP_TRIPIN9 = 8,   //!< Trip 9
    EPWM_DC_TRIP_TRIPIN10 = 9,  //!< Trip 10
    EPWM_DC_TRIP_TRIPIN11 = 10, //!< Trip 11
    EPWM_DC_TRIP_TRIPIN12 = 11, //!< Trip 12
    EPWM_DC_TRIP_TRIPIN14 = 13, //!< Trip 14
    EPWM_DC_TRIP_TRIPIN15 = 14, //!< Trip 15
    EPWM_DC_TRIP_COMBINATION = 15 //!< All Trips (Trip1 - Trip 15) are selected
}EPWM_DigitalCompareTripInput;

//*****************************************************************************
//
// Values that can be passed to EPWM_enableDigitalCompareTripCombinationInput()
// or EPWM_disableDigitalCompareTripCombinationInput() as the tripInput
// parameter.
//
//*****************************************************************************
//! Combinational Trip 1 input
#define EPWM_DC_COMBINATIONAL_TRIPIN1   0x1U
//! Combinational Trip 2 input
#define EPWM_DC_COMBINATIONAL_TRIPIN2   0x2U
//! Combinational Trip 3 input
#define EPWM_DC_COMBINATIONAL_TRIPIN3   0x4U
//! Combinational Trip 4 input
#define EPWM_DC_COMBINATIONAL_TRIPIN4   0x8U
//! Combinational Trip 5 input
#define EPWM_DC_COMBINATIONAL_TRIPIN5   0x10U
//! Combinational Trip 6 input
#define EPWM_DC_COMBINATIONAL_TRIPIN6   0x20U
//! Combinational Trip 7 input
#define EPWM_DC_COMBINATIONAL_TRIPIN7   0x40U
//! Combinational Trip 8 input
#define EPWM_DC_COMBINATIONAL_TRIPIN8   0x80U
//! Combinational Trip 9 input
#define EPWM_DC_COMBINATIONAL_TRIPIN9   0x100U
//! Combinational Trip 10 input
#define EPWM_DC_COMBINATIONAL_TRIPIN10  0x200U
//! Combinational Trip 11 input
#define EPWM_DC_COMBINATIONAL_TRIPIN11  0x400U
//! Combinational Trip 12 input
#define EPWM_DC_COMBINATIONAL_TRIPIN12  0x800U
//! Combinational Trip 14 input
#define EPWM_DC_COMBINATIONAL_TRIPIN14  0x2000U
//! Combinational Trip 15 input
#define EPWM_DC_COMBINATIONAL_TRIPIN15  0x4000U

//*****************************************************************************
//
// Values that can be passed to EPWM_setDigitalCompareBlankingEvent() as the
// the blankingPulse parameter.
//
//*****************************************************************************
typedef enum
{
    //! Time base counter equals period
    EPWM_DC_WINDOW_START_TBCTR_PERIOD = 0,
    //! Time base counter equals zero
    EPWM_DC_WINDOW_START_TBCTR_ZERO   = 1,
    //! Time base counter equals zero
    EPWM_DC_WINDOW_START_TBCTR_ZERO_PERIOD  = 2
}EPWM_DigitalCompareBlankingPulse;

//*****************************************************************************
//
// Values that can be passed to EPWM_setDigitalCompareFilterInput()
// as the filterInput parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DC_WINDOW_SOURCE_DCAEVT1 = 0, //!< DC filter signal source is DCAEVT1
    EPWM_DC_WINDOW_SOURCE_DCAEVT2 = 1, //!< DC filter signal source is DCAEVT2
    EPWM_DC_WINDOW_SOURCE_DCBEVT1 = 2, //!< DC filter signal source is DCBEVT1
    EPWM_DC_WINDOW_SOURCE_DCBEVT2 = 3  //!< DC filter signal source is DCBEVT2
}EPWM_DigitalCompareFilterInput;

//*****************************************************************************
//
// Values that can be assigned to EPWM_setDigitalCompareEventSource(),
// EPWM_setDigitalCompareEventSyncMode(),EPWM_enableDigitalCompareADCTrigger(),
// EPWM_disableDigitalCompareADCTrigger(), EPWM_enableDigitalCompareSyncEvent()
// EPWM_disableDigitalCompareSyncEvent() as the dcModule parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DC_MODULE_A = 0, //!< Digital Compare Module A
    EPWM_DC_MODULE_B = 1  //!< Digital Compare Module B
}EPWM_DigitalCompareModule;

//*****************************************************************************
//
// Values that can be passed to EPWM_setDigitalCompareEventSource() as the
// dcEvent parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_DC_EVENT_1 = 0, //!< Digital Compare Event number 1
    EPWM_DC_EVENT_2 = 1  //!< Digital Compare Event number 2
}EPWM_DigitalCompareEvent;

//*****************************************************************************
//
// Values that can be passed to EPWM_setDigitalCompareEventSource() as the
// dcEventSource parameter.
//
//*****************************************************************************
typedef enum
{
    //! signal source is unfiltered (DCAEVT1/2)
    EPWM_DC_EVENT_SOURCE_ORIG_SIGNAL = 0,
    //! signal source is filtered (DCEVTFILT)
    EPWM_DC_EVENT_SOURCE_FILT_SIGNAL = 1
}EPWM_DigitalCompareEventSource;

//*****************************************************************************
//
// Values that can be passed to EPWM_setDigitalCompareEventSyncMode() as the
// syncMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! DC input signal is synced with TBCLK
    EPWM_DC_EVENT_INPUT_SYNCED = 0,
    //! DC input signal is not synced with TBCLK
    EPWM_DC_EVENT_INPUT_NOT_SYNCED = 1
}EPWM_DigitalCompareSyncMode;

//*****************************************************************************
//
// Values that can be passed to the loadPulse variable of
// EPWM_setGlobalShadowLoadPulse() function
//
//*****************************************************************************
typedef enum
{
    //! load when counter is equal to zero
    EPWM_GL_LOAD_PULSE_CNTER_ZERO = 0x0,
    //! load when counter is equal to period
    EPWM_GL_LOAD_PULSE_CNTER_PERIOD = 0x1,
    //! load when counter is equal to zero or period
    EPWM_GL_LOAD_PULSE_CNTER_ZERO_PERIOD = 0x2,
    //! load on sync event
    EPWM_GL_LOAD_PULSE_SYNC = 0x3,
    //! load on sync event or when counter  is equal to zero
    EPWM_GL_LOAD_PULSE_SYNC_OR_CNTER_ZERO = 0x4,
    //! load on sync event or when counter  is equal to period
    EPWM_GL_LOAD_PULSE_SYNC_OR_CNTER_PERIOD = 0x5,
    //! load on sync event or when counter is equal to period or zero
    EPWM_GL_LOAD_PULSE_SYNC_CNTER_ZERO_PERIOD = 0x6,
    //! load on global force
    EPWM_GL_LOAD_PULSE_GLOBAL_FORCE = 0xF
}EPWM_GlobalLoadTrigger;

//*****************************************************************************
//
// Values that can be passed to EPWM_enableGlobalLoadRegisters() or
// EPWM_disableGlobalLoadRegisters() as the loadRegister parameter.
//
//*****************************************************************************
#define EPWM_GL_REGISTER_TBPRD_TBPRDHR   0x1U   //!< Global load TBPRD:TBPRDHR
#define EPWM_GL_REGISTER_CMPA_CMPAHR     0x2U   //!< Global load CMPA:CMPAHR
#define EPWM_GL_REGISTER_CMPB_CMPBHR     0x4U   //!< Global load CMPB:CMPBHR
#define EPWM_GL_REGISTER_CMPC            0x8U   //!< Global load CMPC
#define EPWM_GL_REGISTER_CMPD            0x10U  //!< Global load CMPD
#define EPWM_GL_REGISTER_DBRED_DBREDHR   0x20U  //!< Global load DBRED:DBREDHR
#define EPWM_GL_REGISTER_DBFED_DBFEDHR   0x40U  //!< Global load DBFED:DBFEDHR
#define EPWM_GL_REGISTER_DBCTL           0x80U  //!< Global load DBCTL
#define EPWM_GL_REGISTER_AQCTLA_AQCTLA2  0x100U //!< Global load AQCTLA/A2
#define EPWM_GL_REGISTER_AQCTLB_AQCTLB2  0x200U //!< Global load AQCTLB/B2
#define EPWM_GL_REGISTER_AQCSFRC         0x400U //!< Global load AQCSFRC

//*****************************************************************************
//
// Values that can be passed to EPWM_setValleyTriggerSource() as the trigger
// parameter.
//
//*****************************************************************************
typedef enum
{
    //! Valley capture trigged by software.
    EPWM_VALLEY_TRIGGER_EVENT_SOFTWARE = 0U ,
    //! Valley capture trigged by when counter is equal to zero.
    EPWM_VALLEY_TRIGGER_EVENT_CNTER_ZERO = 1U,
    //! Valley capture trigged by when counter is equal period.
    EPWM_VALLEY_TRIGGER_EVENT_CNTER_PERIOD = 2U,
    //! Valley capture trigged when counter is equal to zero or period.
    EPWM_VALLEY_TRIGGER_EVENT_CNTER_ZERO_PERIOD = 3U,
    //! Valley capture trigged by DCAEVT1 (Digital Compare A event 1)
    EPWM_VALLEY_TRIGGER_EVENT_DCAEVT1 = 4U,
    //! Valley capture trigged by DCAEVT2 (Digital Compare A event 2)
    EPWM_VALLEY_TRIGGER_EVENT_DCAEVT2 = 5U,
    //! Valley capture trigged by DCBEVT1 (Digital Compare B event 1)
    EPWM_VALLEY_TRIGGER_EVENT_DCBEVT1 = 6U,
    //! Valley capture trigged by DCBEVT2 (Digital Compare B event 2)
    EPWM_VALLEY_TRIGGER_EVENT_DCBEVT2 = 7U
}EPWM_ValleyTriggerSource;

//*****************************************************************************
//
// Values that can be passed to EPWM_getValleyCountEdgeStatus() as the edge
// parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_VALLEY_COUNT_START_EDGE = 0, //!< Valley count start edge
    EPWM_VALLEY_COUNT_STOP_EDGE =1    //!< Valley count stop edge
}EPWM_ValleyCounterEdge;

//*****************************************************************************
//
// Values that can be passed to EPWM_setValleyDelayValue() as the delayMode
// parameter.
//
//*****************************************************************************
typedef enum
{
    //! Delay value equals the offset value defines by software
    EPWM_VALLEY_DELAY_MODE_SW_DELAY   = 0U,
    //! Delay value equals the sum of the Hardware counter value and the offset
    //! value defines by software
    EPWM_VALLEY_DELAY_MODE_VCNT_DELAY_SW_DELAY = 1U,
    //! Delay value equals the the Hardware counter shifted by
    //! (1 + the offset value defines by software)
    EPWM_VALLEY_DELAY_MODE_VCNT_DELAY_SHIFT_1_SW_DELAY = 2U,
    //! Delay value equals the the Hardware counter shifted by
    //! (2 + the offset value defines by software)
    EPWM_VALLEY_DELAY_MODE_VCNT_DELAY_SHIFT_2_SW_DELAY = 3U,
    //! Delay value equals the the Hardware counter shifted by
    //! (4 + the offset value defines by software)
    EPWM_VALLEY_DELAY_MODE_VCNT_DELAY_SHIFT_4_SW_DELAY = 4U
}EPWM_ValleyDelayMode;

//*****************************************************************************
//
// Values that can be passed to EPWM_lockRegisters() as the registerGroup
// parameter.
//
//*****************************************************************************
typedef enum
{
    EPWM_REGISTER_GROUP_GLOBAL_LOAD = 1,     //!< Global load register group
    EPWM_REGISTER_GROUP_TRIP_ZONE = 2,       //!< Trip zone register group
    EPWM_REGISTER_GROUP_TRIP_ZONE_CLEAR = 3, //!< Trip zone clear group
    EPWM_REGISTER_GROUP_DIGITAL_COMPARE = 4  //!< Digital compare group
}EPWM_LockRegisterGroup;

//*****************************************************************************
//
// Prototypes for the API.
//
//*****************************************************************************

//*****************************************************************************
//
//! \internal
//! Checks ePWM base address.
//!
//! \param base specifies the ePWM module base address.
//!
//! This function determines if an ePWM module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool EPWM_isBaseValid(uint32_t base)
{
    return((base == EPWM1_BASE) || (base == EPWM2_BASE)||
           (base == EPWM3_BASE) || (base == EPWM4_BASE)||
           (base == EPWM5_BASE) || (base == EPWM6_BASE)||
           (base == EPWM7_BASE) || (base == EPWM8_BASE));
}
#endif


