gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    if(((uint16_t)compModule == EPWM_COUNTER_COMPARE_A) ||
       ((uint16_t)compModule == EPWM_COUNTER_COMPARE_C))
    {
        syncModeOffset = 10U;
        loadModeOffset = 0U;
        shadowModeOffset = 4U;
    }
    else if(((uint16_t)compModule == EPWM_COUNTER_COMPARE_B) ||
            ((uint16_t)compModule == EPWM_COUNTER_COMPARE_D))
    {
        syncModeOffset = 12U;
        loadModeOffset = 2U;
        shadowModeOffset = 6U;
    }
    // Get the register offset.  EPWM_O_CMPCTL for A&B or
    // EPWM_O_CMPCTL2 for C&D
    registerOffset = base + EPWM_O_CMPCTL + ((uint16_t)compModule & 0x1U);

    // If shadow load mode is enabled
    if(enableShadowLoad)
    {
        // Set the appropriate sync and load mode bits and also enable shadow
        // load mode. Shadow to active load can also be frozen.
        HWREGH(registerOffset) = ((HWREGH(registerOffset) &
                        ((~(0x3U << syncModeOffset)) | // Clear sync mode
                         (~(0x3U << loadModeOffset)) | // Clear load mode
                         (~(0x1U << shadowModeOffset)))) | // shadow mode
                         ((((uint16_t)loadMode >> 2U) << syncModeOffset) |
                         (((uint16_t)loadMode & 0x3U) << loadModeOffset)));
    }
    else
    {
        // Disable shadow load mode.
        HWREGH(registerOffset) = (HWREGH(registerOffset) |
                                  (0x1U << shadowModeOffset));
    }

}

//*****************************************************************************
//
//! Set counter compare values.
//!
//! \param base is the base address of the EPWM module.
//! \param compModule is the Counter Compare value module.
//! \param compCount is the counter compare count value.
//!
//! This function sets the counter compare value for counter compare registers.
//! The maximum value for compCount is 0xFFFF.
//! Valid values for compModule are:
//!   - EPWM_COUNTER_COMPARE_A - counter compare A.
//!   - EPWM_COUNTER_COMPARE_B - counter compare B.
//!   - EPWM_COUNTER_COMPARE_C - counter compare C.
//!   - EPWM_COUNTER_COMPARE_D - counter compare D.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setCounterCompareValue(uint32_t base,
                                 EPWM_CounterCompareModule compModule,
                                 uint16_t compCount)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));

    // Get the register offset for the Counter compare
    registerOffset = EPWM_O_CMPA + (uint16_t)compModule;
    // Write to the counter compare registers.
    if(((uint16_t)compModule == EPWM_COUNTER_COMPARE_A) ||
        ((uint16_t)compModule == EPWM_COUNTER_COMPARE_B))
    {
        // write to CMPA or COMPB bits
        HWREG(base + registerOffset) =
             ((HWREG(base + registerOffset) & (uint32_t)0x0000FFFFU) |
              ((uint32_t)compCount << 16U));
    }
    else if(((uint16_t)compModule == EPWM_COUNTER_COMPARE_C) ||
            ((uint16_t)compModule == EPWM_COUNTER_COMPARE_D))
    {
        // write to COMPC or COMPD bits
        HWREGH(base + registerOffset) = compCount;
    }
}

//*****************************************************************************
//
//! Return the counter compare shadow register full status.
//!
//! \param base is the base address of the EPWM module.
//! \param compModule is the Counter Compare value module.
//!
//! This function returns the counter Compare shadow register full status flag.
//! Valid values for compModule are:
//!   - EPWM_COUNTER_COMPARE_A - counter compare A.
//!   - EPWM_COUNTER_COMPARE_B - counter compare B.
//!
//! \return Returns true if the shadow register is full.
//!         Returns false if the shadow register is not full.
//
//*****************************************************************************
static inline uint16_t EPWM_getCounterCompareShadowStatus(uint32_t base,
                                         EPWM_CounterCompareModule compModule)
{
    ASSERT(EPWM_isBaseValid(base));

    // Read the value of SHDWAFULL or SHDWBFULL bit
    return((((HWREG(base + EPWM_O_CMPCTL) >>
              ((((uint16_t)compModule >> 1U) & 0x1U) + 8U)) &
              0x1U) == 0x1U) ? true:false);
}

// Action Qualifier functions
//*****************************************************************************
//
//! Sets the Action Qualifier shadow load mode
//!
//! \param base is the base address of the EPWM module.
//! \param aqModule is the Action Qualifier module value.
//! \param loadMode is the shadow to active load mode.
//! \param enableShadowLoad is the shadow load mode flag.
//!
//! This function sets the Action Qualifier  shadow load mode. Valid
//! values for the variables are:
//!  - aqModule
//!      - EPWM_ACTION_QUALIFIER_A - Action Qualifier A.
//!      - EPWM_ACTION_QUALIFIER_B - Action Qualifier B.
//!  - loadMode
//!      - EPWM_AQ_LOAD_ON_CNTER_ZERO - load when counter equals zero
//!      - EPWM_AQ_LOAD_ON_CNTER_PERIOD - load when counter equals period
//!      - EPWM_AQ_LOAD_ON_CNTER_ZERO_PERIOD - load when counter equals
//!                                               zero or period
//!      - EPWM_AQ_LOAD_FREEZE  - Freeze shadow to active load
//!      - EPWM_AQ_LOAD_ON_SYNC_CNTER_ZERO - load when counter equals zero
//!      - EPWM_AQ_LOAD_ON_SYNC_CNTER_PERIOD -load when counter equals period
//!      - EPWM_AQ_LOAD_ON_SYNC_CNTER_ZERO_PERIOD - load when counter equals
//!                                                   zero or period
//!      - EPWM_AQ_LOAD_ON_SYNC_ONLY - load on sync only
//!  - enableShadowLoad
//!      - true  - Enable shadow load mode.
//!      - false - Disable shadow load-immediate load only.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setActionQualifierShadowLoadMode(uint32_t base,
                                        EPWM_ActionQualifierModule aqModule,
                                        EPWM_ActionQualifierLoadMode loadMode,
                                        bool enableShadowLoad)
{
    uint16_t syncModeOffset;
    uint16_t shadowModeOffset;

    syncModeOffset = 8U + (uint16_t)aqModule;
    shadowModeOffset = 4U + (uint16_t)aqModule;

