gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    // Set the one time software forced action
    if((uint16_t)epwmOutput == EPWM_AQ_OUTPUT_A)
    {
        HWREGH(base + EPWM_O_AQSFRC) =
                    ((HWREGH(base + EPWM_O_AQSFRC) | ~EPWM_AQSFRC_ACTSFA_M) |
                     ((uint16_t)output));
    }
    else if((uint16_t)epwmOutput == EPWM_AQ_OUTPUT_B)
    {
        HWREGH(base + EPWM_O_AQSFRC) =
                    ((HWREGH(base + EPWM_O_AQSFRC) | ~EPWM_AQSFRC_ACTSFB_M) |
                     ((uint16_t)output << EPWM_AQSFRC_ACTSFB_S));
    }
}

//*****************************************************************************
//
//! Triggers a one time software forced event on Action qualifier
//!
//! \param base is the base address of the EPWM module.
//! \param epwmOutput is the ePWM pin type.
//!
//! This function triggers a one time software forced Action Qualifier event
//! on ePWM A or B based on the value of epwmOutput.
//! Valid values for epwmOutput are:
//!   - EPWM_AQ_OUTPUT_A          - ePWMxA output
//!   - EPWM_AQ_OUTPUT_B          - ePWMxB output
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_forceActionQualifierSwAction(uint32_t base,
                                  EPWM_ActionQualifierOutputModule epwmOutput)
{
    ASSERT(EPWM_isBaseValid(base));

    // Initiate a software forced event
    if((uint16_t)epwmOutput == EPWM_AQ_OUTPUT_A)
    {
        HWREGH(base + EPWM_O_AQSFRC) |= EPWM_AQSFRC_OTSFA;
    }
    else if((uint16_t)epwmOutput == EPWM_AQ_OUTPUT_B)
    {
        HWREGH(base + EPWM_O_AQSFRC) |= EPWM_AQSFRC_OTSFB;
    }
}

// Dead Band
//*****************************************************************************
//
//! Sets Dead Band signal output swap mode.
//!
//! \param base is the base address of the EPWM module.
//! \param output is the ePWM Dead Band output.
//! \param enableSwapMode is the output swap mode.
//!
//! This function sets up the output signal swap mode. For example if the
//! output variable is set to EPWM_DB_OUTPUT_A and enableSwapMode is true, then
//! the ePWM A output gets its signal from the ePWM B signal path. Valid values
//! for the input variables are:
//!   output
//!     - EPWM_DB_OUTPUT_A   - ePWM output A
//!     - EPWM_DB_OUTPUT_B   - ePWM output B
//!   enableSwapMode
//!     - true     - the output is swapped
//!     - false    - the output and the signal path are the same.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setDeadBandOutputSwapMode(uint32_t base,
                                                  EPWM_DeadBandOutput output,
                                                  bool enableSwapMode)
{
    uint16_t mask;

    ASSERT(EPWM_isBaseValid(base));

    mask = 1U << ((uint16_t)output + EPWM_DBCTL_OUTSWAP_S);

    if(enableSwapMode)
    {
        // Set the appropriate outswap bit to swap output
        HWREGH(base + EPWM_O_DBCTL) =
                      ((HWREGH(base + EPWM_O_DBCTL) & ~ mask) | mask);
    }
    else
    {
         // Clear the appropriate outswap bit to disable output swap
         HWREGH(base + EPWM_O_DBCTL) = (HWREGH(base + EPWM_O_DBCTL) & ~ mask);
    }
}

//*****************************************************************************
//
//! Sets Dead Band signal output mode.
//!
//! \param base is the base address of the EPWM module.
//! \param delayMode is the Dead Band delay type.
//! \param enableDelayMode is the dead band delay mode.
//!
//! This function sets up the dead band delay mode. The delayMode variable
//! determines if the applied delay is Rising Edge or Falling Edge. The
//! enableDelayMode determines if a dead band delay should be applied.
//! Valid values for the variables are:
//!   delayMode
//!     - EPWM_DB_RED   - Rising Edge delay
//!     - EPWM_DB_FED   - Falling Edge delay
//!   enableDelayMode
//!     - true     - Falling edge or Rising edge delay is applied.
//!     - false    - Dead Band delay is bypassed.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setDeadBandDelayMode(uint32_t base,
                                             EPWM_DeadBandDelayMode delayMode,
                                             bool enableDelayMode)
{
    uint16_t mask;

    ASSERT(EPWM_isBaseValid(base));

    mask = 1U << ((uint16_t)delayMode + EPWM_DBCTL_OUT_MODE_S);

    if(enableDelayMode)
    {
         // Set the appropriate outmode bit to enable Dead Band delay
      HWREGH(base + EPWM_O_DBCTL) =
                   ((HWREGH(base + EPWM_O_DBCTL) & ~ mask) | mask);
    }
    else
    {
         // Clear the appropriate outswap bit to disable output swap
      HWREGH(base + EPWM_O_DBCTL) = (HWREGH(base + EPWM_O_DBCTL) & ~ mask);
    }
}

//*****************************************************************************
//
//! Sets Dead Band delay polarity.
//!
//! \param base is the base address of the EPWM module.
//! \param delayMode is the Dead Band delay type.
//! \param polarity is the polarity of the delayed signal.
//!
//! This function sets up the polarity as determined by the variable polarity ,
//! of the Falling Edge or Rising Edge delay depending on the value of
//! delayMode. Valid values for the variables are:
//!   delayMode
//!     - EPWM_DB_RED   - Rising Edge delay
//!     - EPWM_DB_FED   - Falling Edge delay
//!   polarity
//!     - EPWM_DB_POLARITY_ACTIVE_HIGH   - polarity is not inverted.
//!     - EPWM_DB_POLARITY_ACTIVE_LOW    - polarity is inverted.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setDeadBandDelayPolarity(uint32_t base,
                                   EPWM_DeadBandDelayMode delayMode,
                                   EPWM_DeadBandPolarity polarity)
{
    uint16_t shift;

    ASSERT(EPWM_isBaseValid(base));

    shift = ((~(uint16_t)delayMode & 0x1U) + EPWM_DBCTL_POLSEL_S);

    // Set the appropriate polsel bits for dead band polarity
    HWREGH(base + EPWM_O_DBCTL) =
                       ((HWREGH(base + EPWM_O_DBCTL) & ~ (1U << shift)) |
                        ((uint16_t)polarity << shift));
}

//*****************************************************************************
//
//! Sets Rising Edge Dead Band delay input.
//!
//! \param base is the base address of the EPWM module.
//! \param input is the input signal to the dead band.
//!
//! This function sets up the rising Edge delay input signal.
//! Valid values for input are:
//!     - EPWM_DB_INPUT_EPWMA   - Input signal is ePWMA( Valid for both Falling
//!                                  Edge and Rising Edge)
//!     - EPWM_DB_INPUT_EPWMB   - Input signal is ePWMA( Valid for both Falling
//!                                  Edge and Rising Edge)
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setRisingEdgeDeadBandDelayInput(uint32_t base,
                                                        uint16_t input)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((input == EPWM_DB_INPUT_EPWMA) ||
           (input == EPWM_DB_INPUT_EPWMB));

    // Set the Rising Edge Delay input
    HWREGH(base + EPWM_O_DBCTL) =
            ((HWREGH(base + EPWM_O_DBCTL) & ~(1U << EPWM_DBCTL_IN_MODE_S)) |
             (input << EPWM_DBCTL_IN_MODE_S));
}

//*****************************************************************************
//
//! Sets Dead Band delay input.
//!
//! \param base is the base address of the EPWM module.
//! \param input is the input signal to the dead band.
//!
//! This function sets up the rising Edge delay input signal.
//! Valid values for input are:
//!   - EPWM_DB_INPUT_EPWMA   - Input signal is ePWMA( Valid for both Falling
//!                                Edge and Rising Edge)
//!   - EPWM_DB_INPUT_EPWMB   - Input signal is ePWMA( Valid for both Falling
//!                                Edge and Rising Edge)
//!   - EPWM_DB_INPUT_DB_RED  - Input signal is the output of Rising
//!                                Edge delay.
//!                               (Valid only for Falling Edge delay)
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setFallingEdgeDeadBandDelayInput(uint32_t base,
                                                         uint16_t input)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((input == EPWM_DB_INPUT_EPWMA) ||
           (input == EPWM_DB_INPUT_EPWMB) ||
           (input == EPWM_DB_INPUT_DB_RED));

