gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    if(input == EPWM_DB_INPUT_DB_RED)
    {
        // Set the Falling Edge Delay input
        HWREGH(base + EPWM_O_DBCTL) |= EPWM_DBCTL_DEDB_MODE;
    }
    else
    {
        // Set the Falling Edge Delay input
        HWREGH(base + EPWM_O_DBCTL) &= ~EPWM_DBCTL_DEDB_MODE;
        // Set the Rising Edge Delay input
        HWREGH(base + EPWM_O_DBCTL) =
        ((HWREGH(base + EPWM_O_DBCTL) & ~(1U << (EPWM_DBCTL_IN_MODE_S + 1U))) |
         (input << (EPWM_DBCTL_IN_MODE_S + 1U)));
    }
}

//*****************************************************************************
//
//! Set the Dead Band control load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param enableShadowLoad is the shadow mode load flag.
//! \param loadMode is the shadow to active load mode.
//!
//! This function sets the Dead Band control register load mode.
//! Valid values for the parameters are:
//!   shadowLoadFlag
//!     - true    - Shadow load mode is enabled
//!     - false   - Immediate load mode only
//!   loadMode
//!     - EPWM_DB_LOAD_ON_CNTER_ZERO         - load when counter equals zero.
//!     - EPWM_DB_LOAD_ON_CNTER_PERIOD       - load when counter equals period.
//!     - EPWM_DB_LOAD_ON_CNTER_ZERO_PERIOD  - load when counter equals zero or
//!                                            period.
//!     - EPWM_DB_LOAD_FREEZE                - Freeze shadow to active load.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setDeadBandControlShadowLoadMode(uint32_t base,
                                       bool enableShadowLoad,
                                       EPWM_DeadBandControlLoadMode loadMode)
{
    ASSERT(EPWM_isBaseValid(base));

    // Check if shadow mode is enabled
    if(enableShadowLoad)
    {
        // Enable the shadow mode and setup the load event
        HWREGH(base + EPWM_O_DBCTL2) =
          ((HWREGH(base + EPWM_O_DBCTL2) & ~EPWM_DBCTL2_LOADDBCTLMODE_M) |
           (EPWM_DBCTL2_SHDWDBCTLMODE | (uint16_t)loadMode));
    }
    else
    {
        // Disable the shadow load mode. Only immediate load mode only.
        HWREGH(base + EPWM_O_DBCTL2) =
                 (HWREGH(base + EPWM_O_DBCTL2) & ~EPWM_DBCTL2_SHDWDBCTLMODE);
     }
}

//*****************************************************************************
//
//! Set the RED (Rising Edge Delay)load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param enableShadowLoad is the shadow mode load flag.
//! \param loadMode is the shadow to active load event.
//!
//! This function sets the Rising Edge Delay register load mode.
//! Valid values for the parameters are:
//!   enableShadowLoad
//!     - true    - Shadow load mode enabled.
//!     - false   - Immediate load mode only
//!   loadMode
//!     - EPWM_RED_LOAD_ON_CNTER_ZERO        - load when counter equals zero.
//!     - EPWM_RED_LOAD_ON_CNTER_PERIOD      - load when counter equals period.
//!     - EPWM_RED_LOAD_ON_CNTER_ZERO_PERIOD - load when counter equals zero or
//!                                            period.
//!     - EPWM_RED_LOAD_FREEZE               - Freeze shadow to active load.
//!
//!    \b Note: The loadMode parameters are valid only if shadow mode is
//!             enabled.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setRisingEdgeDelayCountShadowLoadMode(uint32_t base,
                                        bool enableShadowLoad,
                                        EPWM_RisingEdgeDelayLoadMode loadMode)
{
    ASSERT(EPWM_isBaseValid(base));

     // Check if shadow mode is enabled
     if(enableShadowLoad)
     {
          // Enable the shadow mode. Setup the load mode
          HWREGH(base + EPWM_O_DBCTL) =
               ((HWREGH(base + EPWM_O_DBCTL) & ~EPWM_DBCTL_LOADREDMODE_M) |
                (EPWM_DBCTL_SHDWDBREDMODE |
                ((uint16_t)loadMode << EPWM_DBCTL_LOADREDMODE_S)));
      }
      else
      {
          // Disable the shadow mode.
          HWREGH(base + EPWM_O_DBCTL) =
                    (HWREGH(base + EPWM_O_DBCTL) & ~EPWM_DBCTL_SHDWDBREDMODE);
      }
}

//*****************************************************************************
//
//! Set the FED (Falling Edge Delay)load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param enableShadowLoad is the shadow mode load flag.
//! \param loadMode is the shadow to active load event.
//!
//! This function sets the Falling Edge Delay register load mode.
//! Valid values for the parameters are:
//!   enableShadowLoad
//!     - true    - Shadow load mode enabled.
//!     - false   - Immediate load mode only
//!   loadMode
//!     - EPWM_FED_LOAD_ON_CNTER_ZERO        - load when counter equals zero.
//!     - EPWM_FED_LOAD_ON_CNTER_PERIOD      - load when counter equals period.
//!     - EPWM_FED_LOAD_ON_CNTER_ZERO_PERIOD - load when counter equals zero or
//!                                            period.
//!     - EPWM_FED_LOAD_FREEZE               - Freeze shadow to active load.
//!
//!    \b Note: The loadMode parameters are valid only if shadow mode is
//!             enabled.
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setFallingEdgeDelayCountShadowLoadMode(uint32_t base,
                                        bool enableShadowLoad,
                                        EPWM_FallingEdgeDelayLoadMode loadMode)
{
    ASSERT(EPWM_isBaseValid(base));

     // Check if shadow mode is enabled
     if(enableShadowLoad)
     {
          // Enable the shadow mode. Setup the load mode
          HWREGH(base + EPWM_O_DBCTL) =
               ((HWREGH(base + EPWM_O_DBCTL) & ~EPWM_DBCTL_LOADFEDMODE_M) |
                (EPWM_DBCTL_SHDWDBFEDMODE |
                ((uint16_t)loadMode << EPWM_DBCTL_LOADFEDMODE_S)));
      }
      else
      {
          // Disable the shadow mode.
          HWREGH(base + EPWM_O_DBCTL) =
                    (HWREGH(base + EPWM_O_DBCTL) & ~EPWM_DBCTL_SHDWDBFEDMODE);
      }
}

//*****************************************************************************
//
//! Sets Dead Band Counter clock rate.
//!
//! \param base is the base address of the EPWM module.
//! \param clockMode is the Dead Band counter clock mode.
//!
//! This function sets up the Dead Band counter clock rate with respect to
//! TBCLK (ePWM time base counter).
//! Valid values for clockMode are:
//!   - EPWM_DB_COUNTER_CLOCK_FULL_CYCLE  -Dead band counter runs at TBCLK
//!                                           (ePWM Time Base Counter) rate.
//!   - EPWM_DB_COUNTER_CLOCK_HALF_CYCLE  -Dead band counter runs at 2*TBCLK
//!                                         (twice ePWM Time Base Counter)rate.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setDeadBandCounterClock(uint32_t base,
                                    EPWM_DeadBandClockMode clockMode)
{
    ASSERT(EPWM_isBaseValid(base));

    // Set the DB clock mode
    HWREGH(base + EPWM_O_DBCTL) =
                ((HWREGH(base + EPWM_O_DBCTL) & ~EPWM_DBCTL_HALFCYCLE) |
                 ((uint16_t)clockMode << 15U));
}

//*****************************************************************************
//
//! Set ePWM RED count
//!
//! \param base is the base address of the EPWM module.
//! \param redCount is the RED(Rising Edge Delay) count.
//!
//! This function sets the RED (Rising Edge Delay) count value.
//! The value of fedCount should be less than 0x3FFF.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setRisingEdgeDelayCount(uint32_t base,
                                                uint16_t redCount)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(redCount < 0x4FFFU);
    // Set the RED (Rising Edge Delay) count
    HWREGH(base + EPWM_O_DBRED) = redCount;
}

//*****************************************************************************
//
//! Set ePWM FED count
//!
//! \param base is the base address of the EPWM module.
//! \param fedCount is the FED(Falling Edge Delay) count.
//!
//! This function sets the FED (Falling Edge Delay) count value.
//! The value of fedCount should be less than 0x3FFF.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setFallingEdgeDelayCount(uint32_t base,
                                                 uint16_t fedCount)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(fedCount < 0x4FFFU);
    // Set the RED (Rising Edge Delay) count
    HWREGH(base + EPWM_O_DBFED) = fedCount;
}

// Chopper
//*****************************************************************************
//
//! Enable chopper mode
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables ePAM chopper module.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableChopper(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Set CHPEN bit. Enable Chopper
    HWREGH(base + EPWM_O_PCCTL) |= EPWM_PCCTL_CHPEN;
}

//*****************************************************************************
//
//! Disable chopper mode
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables ePAM chopper module.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableChopper(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Clear CHPEN bit. Disable Chopper
    HWREGH(base + EPWM_O_PCCTL) &= ~EPWM_PCCTL_CHPEN;
}

//*****************************************************************************
//
//! Set chopper duty cycle.
//!
//! \param base is the base address of the EPWM module.
//! \param dutyCycleCount is the chopping clock duty cycle count.
//!
//! This function sets the chopping clock duty cycle. The value of
//! dutyCycleCount should be less than 7. The dutyCycleCount value is converted
//! to the actual chopper duty cycle value base on the following equation:
//!   chopper duty cycle = (dutyCycleCount + 1) / 8
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setChopperDutyCycle(uint32_t base,
                                            uint16_t dutyCycleCount)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(dutyCycleCount < 7U);
    // Set the chopper duty cycle
    HWREGH(base + EPWM_O_PCCTL) =
               ((HWREGH(base + EPWM_O_PCCTL) & ~EPWM_PCCTL_CHPDUTY_M) |
                (dutyCycleCount << EPWM_PCCTL_CHPDUTY_S));
}

//*****************************************************************************
//
//! Set chopper clock frequency scaler.
//!
//! \param base is the base address of the EPWM module.
//! \param freqDiv is the chopping clock frequency divider.
//!
//! This function sets the scaler for the chopping clock frequency. The value
//! of freqDiv should be less than 8. The chopping clock frequency is altered
//! based on the following equation.
//!   chopper clock frequency = SYSCLKOUT / ( 1 + freqDiv)
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setChopperFreq(uint32_t base, uint16_t freqDiv)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(freqDiv < 8U);
    // Set the chopper clock
    HWREGH(base + EPWM_O_PCCTL) =
                    ((HWREGH(base + EPWM_O_PCCTL) & ~EPWM_PCCTL_CHPFREQ_M) |
                     (freqDiv << EPWM_PCCTL_CHPFREQ_S));
}

//*****************************************************************************
//
//! Set chopper clock frequency scaler.
//!
//! \param base is the base address of the EPWM module.
//! \param firstPulseWidth is the width of the first pulse.
//!
//! This function sets the first pulse width of chopper output waveform. The
//! value of firstPulseWidth should be less than 0x10. The value of the first
//! pulse width in seconds is given using the following equation:
//!     first pulse width = 1 / (((firstPulseWidth + 1) * SYSCLKOUT)/8)
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setChopperFirstPulseWidth(uint32_t base,
                                                  uint16_t firstPulseWidth)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(firstPulseWidth < 16U);
    // Set the chopper clock
    HWREGH(base + EPWM_O_PCCTL) =
              ((HWREGH(base + EPWM_O_PCCTL) & ~EPWM_PCCTL_OSHTWTH_M) |
               (firstPulseWidth << EPWM_PCCTL_OSHTWTH_S));
}

// Trip Zone functions
//*****************************************************************************
//
//! Enables Trip Zone signal.
//!
//! \param base is the base address of the EPWM module.
//! \param tzSignal is the Trip Zone signal.
//!
//! This function enables the Trip Zone signals specified by tzSignal as a
//! source for the Trip Zone module.
//! Valid values for tzSignal are:
//!   - EPWM_TZ_SIGNAL_CBC1       - TZ1 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC2       - TZ2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC3       - TZ3 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC4       - TZ4 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC5       - TZ5 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC6       - TZ6 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_DCAEVT2    - DCAEVT2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_DCBEVT2    - DCBEVT2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_OSHT1      - One-shot TZ1
//!   - EPWM_TZ_SIGNAL_OSHT2      - One-shot TZ2
//!   - EPWM_TZ_SIGNAL_OSHT3      - One-shot TZ3
//!   - EPWM_TZ_SIGNAL_OSHT4      - One-shot TZ4
//!   - EPWM_TZ_SIGNAL_OSHT5      - One-shot TZ5
//!   - EPWM_TZ_SIGNAL_OSHT6      - One-shot TZ6
//!   - EPWM_TZ_SIGNAL_DCAEVT1    - One-shot DCAEVT1
//!   - EPWM_TZ_SIGNAL_DCBEVT1    - One-shot DCBEVT1
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableTripZoneSignals(uint32_t base, uint16_t tzSignal)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // Set the trip zone bits
    HWREGH(base + EPWM_O_TZSEL) |= tzSignal;

    EDIS;
}

//*****************************************************************************
//
//! Disables Trip Zone signal.
//!
//! \param base is the base address of the EPWM module.
//! \param tzSignal is the Trip Zone signal.
//!
//! This function disables the Trip Zone signal specified by tzSignal as a
//! source for the Trip Zone module.
//! Valid values for tzSignal are:
//!   - EPWM_TZ_SIGNAL_CBC1       - TZ1 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC2       - TZ2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC3       - TZ3 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC4       - TZ4 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC5       - TZ5 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_CBC6       - TZ6 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_DCAEVT2    - DCAEVT2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_DCBEVT2    - DCBEVT2 Cycle By Cycle
//!   - EPWM_TZ_SIGNAL_OSHT1      - One-shot TZ1
//!   - EPWM_TZ_SIGNAL_OSHT2      - One-shot TZ2
//!   - EPWM_TZ_SIGNAL_OSHT3      - One-shot TZ3
//!   - EPWM_TZ_SIGNAL_OSHT4      - One-shot TZ4
//!   - EPWM_TZ_SIGNAL_OSHT5      - One-shot TZ5
//!   - EPWM_TZ_SIGNAL_OSHT6      - One-shot TZ6
//!   - EPWM_TZ_SIGNAL_DCAEVT1    - One-shot DCAEVT1
//!   - EPWM_TZ_SIGNAL_DCBEVT1    - One-shot DCBEVT1
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableTripZoneSignals(uint32_t base,
                                               uint16_t tzSignal)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // Clear the trip zone bits
    HWREGH(base + EPWM_O_TZSEL) &= ~tzSignal;

    EDIS;
}

//*****************************************************************************
//
//! Set Digital compare conditions that cause Trip Zone event.
//!
//! \param base is the base address of the EPWM module.
//! \param dcType is the Digital compare output type.
//! \param dcEvent is the Digital Compare output event.
//!
//! This function sets up the Digital Compare output Trip Zone event sources.
//! The dcType variable specifies the event source to be whether Digital
//! Compare output A or Digital Compare output B. The dcEvent parameter
//! specifies the event that causes Trip Zone.
//!  Valid values for the parameters are:
//!    dcType
//!      - EPWM_TZ_DC_OUTPUT_A1     - Digital Compare output 1 A
//!      - EPWM_TZ_DC_OUTPUT_A2     - Digital Compare output 2 A
//!      - EPWM_TZ_DC_OUTPUT_B1     - Digital Compare output 1 B
//!      - EPWM_TZ_DC_OUTPUT_B2     - Digital Compare output 2 B
//!    dcEvent
//!      - EPWM_TZ_EVENT_DC_DISABLED         - Event Trigger is disabled
//!      - EPWM_TZ_EVENT_DCXH_LOW            - Trigger event when DCxH low
//!      - EPWM_TZ_EVENT_DCXH_HIGH           - Trigger event when DCxH high
//!      - EPWM_TZ_EVENT_DCXL_LOW            - Trigger event when DCxL low
//!      - EPWM_TZ_EVENT_DCXL_HIGH           - Trigger event when DCxL high
//!      - EPWM_TZ_EVENT_DCXL_HIGH_DCXH_LOW  - Trigger event when DCxL high
//!                                            DCxH low
//!
//!  \note x in DCxH/DCxL represents DCAH/DCAL or DCBH/DCBL
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setTripZoneDigitalCompareEventCondition(uint32_t base,
                                  EPWM_TripZoneDigitalCompareOutput dcType,
                            EPWM_TripZoneDigitalCompareOutputEvent dcEvent)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;

    // Set Digital Compare Events conditions that cause a Digital Compare trip
    HWREGH(base + EPWM_O_TZDCSEL) =
           ((HWREGH(base + EPWM_O_TZDCSEL) & ~(0x7U << (uint16_t)dcType)) |
            ((uint16_t)dcEvent << (uint16_t)dcType));

    EDIS;
}

//*****************************************************************************
//
//! Enable advanced Trip Zone event Action.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables the advanced actions of the Trip Zone events. The
//! advanced features combine the trip zone events with the direction of the
//! counter.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableTripZoneAdvAction(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;

    // Enable Advanced feature. Set ETZE bit
    HWREGH(base + EPWM_O_TZCTL2) |= EPWM_TZCTL2_ETZE;

    EDIS;
}

//*****************************************************************************
//
//! Disable advanced Trip Zone event Action.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables the advanced actions of the Trip Zone events.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableTripZoneAdvAction(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;

    // Disable Advanced feature. clear ETZE bit
    HWREGH(base + EPWM_O_TZCTL2) &= ~EPWM_TZCTL2_ETZE;

    EDIS;
}

//*****************************************************************************
//
//! Set Trip Zone Action.
//!
//! \param base is the base address of the EPWM module.
//! \param tzEvent is the Trip Zone event type.
//! \param tzAction is the Trip zone Action.
//!
//! This function sets the Trip Zone Action to be taken when a Trip Zone event
//! occurs.
//! Valid values for the parameters are:
//!    tzEvent
//!      - EPWM_TZ_ACTION_EVENT_DCBEVT2  - DCBEVT2 (Digital Compare B event 2)
//!      - EPWM_TZ_ACTION_EVENT_DCBEVT1  - DCBEVT1 (Digital Compare B event 1)
//!      - EPWM_TZ_ACTION_EVENT_DCAEVT2  - DCAEVT2 (Digital Compare A event 2)
//!      - EPWM_TZ_ACTION_EVENT_DCAEVT1  - DCAEVT1 (Digital Compare A event 1)
//!      - EPWM_TZ_ACTION_EVENT_TZB      - TZ1 - TZ6 , DCBEVT2 , DCBEVT1
//!      - EPWM_TZ_ACTION_EVENT_TZA      - TZ1 - TZ6 , DCAEVT2 , DCAEVT1
//!    tzAction
//!      - EPWM_TZ_ACTION_HIGH_Z         - high impedance output
//!      - EPWM_TZ_ACTION_HIGH           - high output
//!      - EPWM_TZ_ACTION_LOW            - low low
//!      - EPWM_TZ_ACTION_DISABLE        - disable action
//!
//! \note Disable the advanced Trip Zone event using
//!       EPWM_disableTripZoneAdvAction()  before calling this function.
//! \note This function operates on both ePWMA and ePWMB depending on the
//!       tzEvent parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setTripZoneAction(uint32_t base,
                                          EPWM_TripZoneEvent tzEvent,
                                          EPWM_TripZoneAction tzAction)
{
   ASSERT(EPWM_isBaseValid(base));

   EALLOW;
   // Set the Action for Trip Zone events
   HWREGH(base + EPWM_O_TZCTL) =
        ((HWREGH(base + EPWM_O_TZCTL) & ~(0x3U << (uint16_t)tzEvent)) |
         ((uint16_t)tzAction << (uint16_t)tzEvent)) ;

   EDIS;
}

//*****************************************************************************
//
//! Set Advanced Trip Zone Action.
//!
//! \param base is the base address of the EPWM module.
//! \param tzAdvEvent is the Trip Zone event type.
//! \param tzAdvAction is the Trip zone Action.
//!
//! This function sets the Advanced Trip Zone Action to be taken when an
//! advanced Trip Zone event occurs.
//!
//! Valid values for the parameters are:
//!    tzAdvEvent
//!      - EPWM_TZ_ADV_ACTION_EVENT_TZB_D  - TZ1 - TZ6 ,DCBEVT2 , DCBEVT1 while
//!                                             counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_TZB_U  - TZ1 - TZ6 ,DCBEVT2 , DCBEVT1 while
//!                                             counting up
//!      - EPWM_TZ_ADV_ACTION_EVENT_TZA_D  - TZ1 - TZ6 ,DCAEVT2 , DCAEVT1 while
//!                                             counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_TZA_U  - TZ1 - TZ6 ,DCAEVT2 , DCAEVT1 while
//!                                             counting up
//!    tzAdvAction
//!      - EPWM_TZ_ADV_ACTION_HIGH_Z    - high impedance output
//!      - EPWM_TZ_ADV_ACTION_HIGH      - high voltage state
//!      - EPWM_TZ_ADV_ACTION_LOW       - low voltage state
//!      - EPWM_TZ_ADV_ACTION_TOGGLE    - Toggle output
//!      - EPWM_TZ_ADV_ACTION_DISABLE   - disable action
//!
//! \note This function enables the advanced Trip Zone event.
//!
//! \note This function operates on both ePWMA and ePWMB depending on the
//!       tzAdvEvent  parameter.
//! \note Advanced Trip Zone events take into consideration the direction of
//!       the counter in addition to Trip Zone events.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setTripZoneAdvAction(uint32_t base,
                               EPWM_TripZoneAdvancedEvent tzAdvEvent,
                               EPWM_TripZoneAdvancedAction tzAdvAction)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;

    // Set the Advanced Action for Trip Zone events
    HWREGH(base + EPWM_O_TZCTL2) =
       ((HWREGH(base + EPWM_O_TZCTL2) & ~(0x7U << (uint16_t)tzAdvEvent)) |
        ((uint16_t)tzAdvAction << (uint16_t)tzAdvEvent));

    HWREGH(base + EPWM_O_TZCTL2) |= EPWM_TZCTL2_ETZE;

    EDIS;
}

