gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
//*****************************************************************************
//
//! Set Advanced Digital Compare Trip Zone Action on ePWMA.
//!
//! \param base is the base address of the EPWM module.
//! \param tzAdvDcEvent is the Digital Compare Trip Zone event type.
//! \param tzAdvDcAction is the Digital Compare Trip zone Action.
//!
//! This function sets the Digital Compare (DC) Advanced Trip Zone Action to be
//! taken on ePWMA when an advanced Digital Compare Trip Zone A event occurs.
//! Valid values for the parameters are:
//!    tzAdvDcEvent
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_D  - Digital Compare event A2 while
//!                                                 counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_U  - Digital Compare event A2 while
//!                                                 counting up
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_D  - Digital Compare event A1 while
//!                                                 counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_U  - Digital Compare event A1 while
//!                                                 counting up
//!    tzAdvDcAction
//!      - EPWM_TZ_ADV_ACTION_HIGH_Z    - high impedance output
//!      - EPWM_TZ_ADV_ACTION_HIGH      - high voltage state
//!      - EPWM_TZ_ADV_ACTION_LOW       - low voltage state
//!      - EPWM_TZ_ADV_ACTION_TOGGLE    - Toggle output
//!      - EPWM_TZ_ADV_ACTION_DISABLE   - disable action
//!
//! \note This function enables the advanced Trip Zone event.
//!
//! \note Advanced Trip Zone events take into consideration the direction of
//!       the counter in addition to Digital Compare Trip Zone events.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setTripZoneAdvDigitalCompareActionA(uint32_t base,
                           EPWM_TripZoneAdvDigitalComapreEvent tzAdvDcEvent,
                           EPWM_TripZoneAdvancedAction tzAdvDcAction)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // Set the Advanced Action for Trip Zone events
    HWREGH(base + EPWM_O_TZCTLDCA) =
      ((HWREGH(base + EPWM_O_TZCTLDCA) & ~(0x7U << (uint16_t)tzAdvDcEvent)) |
       ((uint16_t)tzAdvDcAction << (uint16_t)tzAdvDcEvent));

    HWREGH(base + EPWM_O_TZCTL2) |= EPWM_TZCTL2_ETZE;

    EDIS;
}

//*****************************************************************************
//
//! Set Advanced Digital Compare Trip Zone Action on ePWMB.
//!
//! \param base is the base address of the EPWM module.
//! \param tzAdvDcEvent is the Digital Compare Trip Zone event type.
//! \param tzAdvDcAction is the Digital Compare Trip zone Action.
//!
//! This function sets the Digital Compare (DC) Advanced Trip Zone Action to be
//! taken on ePWMB when an advanced Digital Compare Trip Zone B event occurs.
//! Valid values for the parameters are:
//!    tzAdvDcEvent
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_D  - Digital Compare event B2 while
//!                                                 counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT2_U  - Digital Compare event B2 while
//!                                                 counting up
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_D  - Digital Compare event B1 while
//!                                                 counting down
//!      - EPWM_TZ_ADV_ACTION_EVENT_DCxEVT1_U  - Digital Compare event B1 while
//!                                                 counting up
//!    tzAdvDcAction
//!      - EPWM_TZ_ADV_ACTION_HIGH_Z    - high impedance output
//!      - EPWM_TZ_ADV_ACTION_HIGH      - high voltage state
//!      - EPWM_TZ_ADV_ACTION_LOW       - low voltage state
//!      - EPWM_TZ_ADV_ACTION_TOGGLE    - Toggle output
//!      - EPWM_TZ_ADV_ACTION_DISABLE   - disable action
//!
//! \note This function enables the advanced Trip Zone event.
//!
//! \note Advanced Trip Zone events take into consideration the direction of
//!       the counter in addition to Digital Compare Trip Zone events.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setTripZoneAdvDigitalCompareActionB(uint32_t base,
                              EPWM_TripZoneAdvDigitalComapreEvent tzAdvDcEvent,
                              EPWM_TripZoneAdvancedAction tzAdvDcAction)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;

    // Set the Advanced Action for Trip Zone events
    HWREGH(base + EPWM_O_TZCTLDCB) =
     ((HWREGH(base + EPWM_O_TZCTLDCB) & ~(0x7U << (uint16_t)tzAdvDcEvent)) |
      ((uint16_t)tzAdvDcAction << (uint16_t)tzAdvDcEvent));

    HWREGH(base + EPWM_O_TZCTL2) |= EPWM_TZCTL2_ETZE;
    EDIS;
}

//*****************************************************************************
//
//! Enable Trip Zone interrupts.
//!
//! \param base is the base address of the EPWM module.
//! \param tzInterrupt is the Trip Zone interrupt.
//!
//! This function enables the Trip Zone interrupts.
//! Valid values for tzInterrupt are:
//!   - EPWM_TZ_INTERRUPT_CBC     - Trip Zones Cycle By Cycle interrupt
//!   - EPWM_TZ_INTERRUPT_OST    - Trip Zones One Shot interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT1 - Digital Compare A Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT2 - Digital Compare A Event 2 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT1 - Digital Compare B Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT2 - Digital Compare B Event 2 interrupt
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_enableTripZoneInterrupt(uint32_t base,
                                                uint16_t tzInterrupt)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((tzInterrupt == EPWM_TZ_INTERRUPT_CBC) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_OST) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCAEVT1) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCAEVT2) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCBEVT1) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCBEVT2));

    EALLOW;

    // Enable Trip zone interrupts
    HWREGH(base + EPWM_O_TZEINT) |= tzInterrupt;

    EDIS;
}

//*****************************************************************************
//
//! Disable Trip Zone interrupts.
//!
//! \param base is the base address of the EPWM module.
//! \param tzInterrupt is the Trip Zone interrupt.
//!
//! This function disables the Trip Zone interrupts.
//! Valid values for tzInterrupt are:
//!   - EPWM_TZ_INTERRUPT_CBC     - Trip Zones Cycle By Cycle interrupt
//!   - EPWM_TZ_INTERRUPT_OST    - Trip Zones One Shot interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT1 - Digital Compare A Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT2 - Digital Compare A Event 2 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT1 - Digital Compare B Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT2 - Digital Compare B Event 2 interrupt
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_disableTripZoneInterrupt(uint32_t base,
                                                 uint16_t tzInterrupt)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((tzInterrupt == EPWM_TZ_INTERRUPT_CBC) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_OST) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCAEVT1) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCAEVT2) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCBEVT1) ||
           (tzInterrupt == EPWM_TZ_INTERRUPT_DCBEVT2));

    EALLOW;

    // Disable Trip zone interrupts
    HWREGH(base + EPWM_O_TZEINT) &= ~tzInterrupt;

    EDIS;
}

//*****************************************************************************
//
//! Gets the Trip Zone interrupt status
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the Trip Zone interrupt status.
//!
//! \return The function returns the following or the bit wise OR value
//!         of the following values.
//!         - EPWM_TZ_INTERRUPT         - Trip Zone interrupt was generated
//!                                          due to the following TZ events.
//!         - EPWM_TZ_INTERRUPT_CBC     - Trip Zones Cycle By Cycle interrupt
//!         - EPWM_TZ_INTERRUPT_OST    - Trip Zones One Shot interrupt
//!         - EPWM_TZ_INTERRUPT_DCAEVT1 - Digital Compare A Event 1 interrupt
//!         - EPWM_TZ_INTERRUPT_DCAEVT2 - Digital Compare A Event 2 interrupt
//!         - EPWM_TZ_INTERRUPT_DCBEVT1 - Digital Compare B Event 1 interrupt
//!         - EPWM_TZ_INTERRUPT_DCBEVT2 - Digital Compare B Event 2 interrupt
//
//***************************************************************************
static inline uint16_t EPWM_getTripZoneInterruptStatus(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the Trip zone interrupt status
    return(HWREGH(base + EPWM_O_TZFLG) & 0x7FU);
}

//*****************************************************************************
//
//! Gets the Trip Zone Cycle by Cycle interrupt status
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the specific Cycle by Cycle Trip Zone interrupt
//! status.
//!
//! \return The function returns the following values.
//!           - EPWM_TZ_CBC_INTERRUPT_CBC1     - CBC interrupt CBC1
//!           - EPWM_TZ_CBC_INTERRUPT_CBC2     - CBC interrupt CBC2
//!           - EPWM_TZ_CBC_INTERRUPT_CBC3     - CBC interrupt CBC3
//!           - EPWM_TZ_CBC_INTERRUPT_CBC4     - CBC interrupt CBC4
//!           - EPWM_TZ_CBC_INTERRUPT_CBC5     - CBC interrupt CBC5
//!           - EPWM_TZ_CBC_INTERRUPT_CBC6     - CBC interrupt CBC6
//!           - EPWM_TZ_CBC_INTERRUPT_DCAEVT2  - CBC interrupt Digital compare
//!                                                event A2
//!           - EPWM_TZ_CBC_INTERRUPT_DCBEVT2  - CBC interrupt Digital compare
//!                                                event B2
//
//***************************************************************************
static inline uint16_t EPWM_getCycleByCycleTripZoneInterruptStatus(uint32_t
                                                                   base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the Cycle By Cycle Trip zone interrupt status
    return(HWREGH(base + EPWM_O_TZCBCFLG) & 0xFFU);
}

//*****************************************************************************
//
//! Gets the Trip Zone One Shot interrupt status
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the specific One Shot Trip Zone interrupt status.
//!
//! \return The function returns the following values.
//!           - EPWM_TZ_OST_INTERRUPT_OST1     - OST interrupt OST1
//!           - EPWM_TZ_OST_INTERRUPT_OST2     - OST interrupt OST2
//!           - EPWM_TZ_OST_INTERRUPT_OST3     - OST interrupt OST3
//!           - EPWM_TZ_OST_INTERRUPT_OST4     - OST interrupt OST4
//!           - EPWM_TZ_OST_INTERRUPT_OST5     - OST interrupt OST5
//!           - EPWM_TZ_OST_INTERRUPT_OST6     - OST interrupt OST6
//!           - EPWM_TZ_OST_INTERRUPT_DCAEVT1  - OST interrupt Digital
//!                                                 compare event A1
//!           - EPWM_TZ_OST_INTERRUPT_DCBEVT1  - OST interrupt Digital
//!                                                 compare event B1
//
//***************************************************************************
static inline uint16_t EPWM_getOneShotTripZoneInterruptStatus(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the One Shot Trip zone interrupt status
    return(HWREGH(base + EPWM_O_TZOSTFLG) & 0xFFU);
}

//*****************************************************************************
//
//! Set the Trip Zone CBC pulse clear event.
//!
//! \param base is the base address of the EPWM module.
//! \param clearEvent is the CBC trip zone clear event.
//!
//! This function set the event which automatically clears the
//! CBC (Cycle by Cycle) latch.
//! Valid values for clearEvent are:
//!   - EPWM_TZ_CBC_PULSE_CLR_CNTR_ZERO         - Clear CBC pulse when counter
//!                                                  equals zero
//!   - EPWM_TZ_CBC_PULSE_CLR_CNTR_PERIOD       - Clear CBC pulse when counter
//!                                                  equals period
//!   - EPWM_TZ_CBC_PULSE_CLR_CNTR_ZERO_PERIOD  - Clear CBC pulse when counter
//!                                                  equals zero or period
//!
//!  \return None.
//
//**************************************************************************
static inline void EPWM_selectCycleByCycleTripZoneClearEvent(uint32_t base,
                                 EPWM_CycleByCycleTripZoneClearMode clearEvent)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // Set the Cycle by Cycle Trip Latch mode
    HWREGH(base + EPWM_O_TZCLR) =
                 ((HWREGH(base + EPWM_O_TZCLR) & ~EPWM_TZCLR_CBCPULSE_M) |
                  ((uint16_t)clearEvent << EPWM_TZCLR_CBCPULSE_S));
    EDIS;
}

//*****************************************************************************
//
//! Clear Trip Zone interrupt flag
//!
//! \param base is the base address of the EPWM module.
//! \param tzIntFlags is the Trip Zone interrupt.
//!
//! This function clears the Trip Zone interrupt flags
//! Valid values for tzIntFlags are:
//!   - EPWM_TZ_INTERRUPT         - Global Trip Zone interrupt
//!   - EPWM_TZ_INTERRUPT_CBC     - Trip Zones Cycle By Cycle interrupt
//!   - EPWM_TZ_INTERRUPT_OST    - Trip Zones One Shot interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT1 - Digital Compare A Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCAEVT2 - Digital Compare A Event 2 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT1 - Digital Compare B Event 1 interrupt
//!   - EPWM_TZ_INTERRUPT_DCBEVT2 - Digital Compare B Event 2 interrupt
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_clearTripZoneInterruptFlag(uint32_t base,
                                                   uint16_t tzIntFlags)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((tzIntFlags < 0x80U) && (tzIntFlags > 0x1U));

    EALLOW;
    // Clear Trip zone event flag
    HWREGH(base + EPWM_O_TZCLR) |= tzIntFlags;
    EDIS;
}

//*****************************************************************************
//
//! Clear the Trip Zone Cycle by Cycle interrupt flag.
//!
//! \param base is the base address of the EPWM module.
//! \param tzCBCIntFlags is the CBC interrupt to be cleared.
//!
//! This function clears the specific Cycle by Cycle Trip Zone interrupt flag.
//! The following are valid values for tzCBCIntFlags.
//!   - EPWM_TZ_CBC_INTERRUPT_CBC1     - CBC interrupt CBC1
//!   - EPWM_TZ_CBC_INTERRUPT_CBC2     - CBC interrupt CBC2
//!   - EPWM_TZ_CBC_INTERRUPT_CBC3     - CBC interrupt CBC3
//!   - EPWM_TZ_CBC_INTERRUPT_CBC4     - CBC interrupt CBC4
//!   - EPWM_TZ_CBC_INTERRUPT_CBC5     - CBC interrupt CBC5
//!   - EPWM_TZ_CBC_INTERRUPT_CBC6     - CBC interrupt CBC6
//!   - EPWM_TZ_CBC_INTERRUPT_DCAEVT2  - CBC interrupt Digital compare
//!                                         event A2
//!   - EPWM_TZ_CBC_INTERRUPT_DCBEVT2  - CBC interrupt Digital compare
//!                                         event B2
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_clearCycleByCycleTripZoneInterruptFlag(uint32_t base,
                                                 uint16_t tzCBCIntFlags)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(tzCBCIntFlags < 0x800U);


    EALLOW;
    // Clear the Cycle By Cycle Trip zone interrupt flag
    HWREGH(base + EPWM_O_TZCBCCLR) |= tzCBCIntFlags;

    EDIS;
}

//*****************************************************************************
//
//! Clear the Trip Zone One Shot interrupt flag.
//!
//! \param base is the base address of the EPWM module.
//! \param tzOSTIntFlags is the OST interrupt to be cleared.
//!
//! This function clears the specific One Shot (OST) Trip Zone interrupt flag.
//! The following are valid values for tzOSTIntFlags.
//!  - EPWM_TZ_OST_INTERRUPT_OST1      - OST interrupt CBC1
//!  - EPWM_TZ_OST_INTERRUPT_OST2      - OST interrupt CBC2
//!  - EPWM_TZ_OST_INTERRUPT_OST3      - OST interrupt CBC3
//!  - EPWM_TZ_OST_INTERRUPT_OST4      - OST interrupt CBC4
//!  - EPWM_TZ_OST_INTERRUPT_OST5      - OST interrupt CBC5
//!  - EPWM_TZ_OST_INTERRUPT_OST6      - OST interrupt CBC6
//!  - EPWM_TZ_OST_INTERRUPT_DCAEVT1   - OST interrupt Digital compare event A1
//!  - EPWM_TZ_OST_INTERRUPT_DCBEVT1   - OST interrupt Digital compare event B1
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_clearOneShotTripZoneInterruptFlag(uint32_t base,
                                                uint16_t tzOSTIntFlags)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(tzOSTIntFlags < 0x800U);

    EALLOW;
    // Clear the Cycle By Cycle Trip zone interrupt flag
    HWREGH(base + EPWM_O_TZOSTCLR) |= tzOSTIntFlags;

    EDIS;
}

//*****************************************************************************
//
//! Force Trip Zone events.
//!
//! \param base is the base address of the EPWM module.
//! \param tzForceEvent is the forced Trip Zone interrupt.
//!
//! This function forces a Trip Zone event.
//! Valid values for tzForceEvent are:
//!   - EPWM_TZ_FORCE_EVENT_CBC     - Force Trip Zones Cycle By Cycle event
//!   - EPWM_TZ_FORCE_EVENT_OST     - Force Trip Zones One Shot Event
//!   - EPWM_TZ_FORCE_EVENT_DCAEVT1 - Force Digital Compare A Event 1
//!   - EPWM_TZ_FORCE_EVENT_DCAEVT2 - Force Digital Compare A Event 2
//!   - EPWM_TZ_FORCE_EVENT_DCBEVT1 - Force Digital Compare B Event 1
//!   - EPWM_TZ_FORCE_EVENT_DCBEVT2 - Force Digital Compare B Event 2
//!
//! \return None.
//
//***************************************************************************
static inline void EPWM_forceTripZoneEvent(uint32_t base,
                                     uint16_t tzForceEvent)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT((tzForceEvent & 0xFF81)== 0U);

    EALLOW;
    // Force a Trip Zone event
    HWREGH(base + EPWM_O_TZFRC) |= tzForceEvent;

    EDIS;
}

