gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    // Set the blanking window length in TBCLK counts
    HWREGH(base + EPWM_O_DCFWINDOW) = windowLengthCount;
}

//*****************************************************************************
//
//! Return DC filter blanking window offset count.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns DC filter blanking window offset count.
//!
//! \return None
//
//*****************************************************************************
static inline uint16_t EPWM_getDigitalCompareBlankingWindowOffsetCount(
                                                                 uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the Blanking Window Offset count
    return(HWREGH(base +EPWM_O_DCFOFFSETCNT));
}

//*****************************************************************************
//
//! Return DC filter blanking window length count.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns DC filter blanking window length count.
//!
//! \return None
//
//*****************************************************************************
static inline uint16_t EPWM_getDigitalCompareBlankingWindowLengthCount(
                                                                 uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the Blanking Window Length count
    return(HWREGH(base +EPWM_O_DCFWINDOWCNT));
}

//*****************************************************************************
//
//! Set up the Digital Compare Event source.
//!
//! \param base is the base address of the EPWM module.
//! \param dcModule is the Digital Compare module.
//! \param dcEvent is the Digital Compare Event number.
//! \param dcEventSource is the - Digital Compare Event source.
//!
//! This function sets up the Digital Compare module Event sources.
//! The following are valid values for the parameters.
//!   dcModule
//!     - EPWM_DC_MODULE_A  - Digital Compare Module A
//!     - EPWM_DC_MODULE_B  - Digital Compare Module B
//!   dcEvent
//!     - EPWM_DC_EVENT_1   - Digital Compare Event number 1
//!     - EPWM_DC_EVENT_2   - Digital Compare Event number 2
//!   dcEventSource
//!     - EPWM_DC_EVENT_SOURCE_FILT_SIGNAL  - signal source is filtered
//!           \note The signal source for this option is DCxEVTy , where the
//!                 value of x is dependent on dcModule and the value of y is
//!                 dependent on dcEvent. Possible signal sources are DCAEVT1,
//!                 DCBEVT1, DCAEVT2 or DCBEVT2 depending on the value of both
//!                 dcModule and dcEvent.
//!     - EPWM_DC_EVENT_SOURCE_ORIG_SIGNAL  - signal source is unfiltered
//!                  The signal source for this option is DCEVTFILT.
//! \return None
//
//*****************************************************************************
static inline void EPWM_setDigitalCompareEventSource(uint32_t base,
                                  EPWM_DigitalCompareModule dcModule,
                                  EPWM_DigitalCompareEvent dcEvent,
                                  EPWM_DigitalCompareEventSource dcEventSource)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));

    registerOffset = EPWM_O_DCACTL + (uint16_t)dcModule;

    // Set the DC event 1 source source
    EALLOW;
    if((uint16_t)dcEvent == EPWM_DC_EVENT_1)
    {
        HWREGH(base + registerOffset) =
                ((HWREGH(base + registerOffset) & ~EPWM_DCACTL_EVT1SRCSEL) |
                 (uint16_t)dcEventSource );
    }
    else
    {
        HWREGH(base + registerOffset) =
                 ((HWREGH(base + registerOffset) & ~EPWM_DCACTL_EVT2SRCSEL) |
                  ((uint16_t)dcEventSource << 8U));
    }
    EDIS;
}

//*****************************************************************************
//
//! Set up the Digital Compare input sync mode.
//!
//! \param base is the base address of the EPWM module.
//! \param dcModule is the Digital Compare module.
//! \param dcEvent is the Digital Compare Event number.
//! \param syncMode is the Digital Compare Event sync mode.
//!
//! This function sets up the Digital Compare module Event sources.
//! The following are valid values for the parameters.
//!   dcModule
//!     - EPWM_DC_MODULE_A  - Digital Compare Module A
//!     - EPWM_DC_MODULE_B  - Digital Compare Module B
//!   dcEvent
//!     - EPWM_DC_EVENT_1   - Digital Compare Event number 1
//!     - EPWM_DC_EVENT_2   - Digital Compare Event number 2
//!   syncMode
//!     - EPWM_DC_EVENT_INPUT_SYNCED      - DC input signal is synced with
//!                                         TBCLK
//!     - EPWM_DC_EVENT_INPUT_NOT SYNCED  - DC input signal is not synced with
//!                                            TBCLK
//!
//! \return None
//
//*****************************************************************************
static inline void EPWM_setDigitalCompareEventSyncMode(uint32_t base,
                                          EPWM_DigitalCompareModule dcModule,
                                          EPWM_DigitalCompareEvent dcEvent,
                                          EPWM_DigitalCompareSyncMode syncMode)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));

    registerOffset = EPWM_O_DCACTL + (uint16_t)dcModule;

    // Set the DC event sync mode
    EALLOW;
    if((uint16_t)dcEvent == EPWM_DC_EVENT_1)
    {
        HWREGH(base + registerOffset) =
           ((HWREGH(base + registerOffset) & ~EPWM_DCACTL_EVT1FRCSYNCSEL) |
            ((uint16_t)syncMode << 1U));
    }
    else
    {
        HWREGH(base + registerOffset) =
            ((HWREGH(base + registerOffset) & ~EPWM_DCACTL_EVT2FRCSYNCSEL) |
             ((uint16_t)syncMode << 9U));
    }
    EDIS;
}

//*****************************************************************************
//
//! Enable Digital Compare to generate Start of Conversion.
//!
//! \param base is the base address of the EPWM module.
//! \param dcModule is the Digital Compare module.
//!
//! This function enables the Digital Compare Event 1 to generate Start of
//! Conversion.
//! The following are valid values for the parameters.
//!   dcModule
//!     - EPWM_DC_MODULE_A  - Digital Compare Module A
//!     - EPWM_DC_MODULE_B  - Digital Compare Module B
//!
//! \return None
//
//*****************************************************************************
static inline void EPWM_enableDigitalCompareADCTrigger(uint32_t base,
                                            EPWM_DigitalCompareModule dcModule)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));


    registerOffset = EPWM_O_DCACTL + (uint16_t)dcModule;

    // Enable digital Compare to generate Start of conversion
    EALLOW;
    HWREGH(base + registerOffset) =
                       (HWREGH(base + registerOffset) | EPWM_DCACTL_EVT1SOCE);
    EDIS;
}

//*****************************************************************************
//
//! Disable Digital Compare from generating Start of Conversion.
//!
//! \param base is the base address of the EPWM module.
//! \param dcModule is the Digital Compare module.
//!
//! This function disables the Digital Compare Event 1 from generating Start of
//! Conversion.
//! The following are valid values for the parameters.
//!   dcModule
//!     - EPWM_DC_MODULE_A  - Digital Compare Module A
//!     - EPWM_DC_MODULE_B  - Digital Compare Module B
//!
//! \return None
//
//*****************************************************************************
static inline void EPWM_disableDigitalCompareADCTrigger(uint32_t base,
                                            EPWM_DigitalCompareModule dcModule)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));


    registerOffset = EPWM_O_DCACTL + (uint16_t)dcModule;

    // Disable digital Compare to generate Start of conversion
    EALLOW;

