gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    // Set EDGEFILTDLYSEL bit
    EALLOW;
    HWREGH(base + EPWM_O_VCAPCTL) |= EPWM_VCAPCTL_EDGEFILTDLYSEL;
    EDIS;
}

//*****************************************************************************
//
//! Disable valley switching delay.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables Valley switching delay.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableValleyHWDelay(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    // Clear EDGEFILTDLYSEL bit
    EALLOW;
    HWREGH(base + EPWM_O_VCAPCTL) &= ~EPWM_VCAPCTL_EDGEFILTDLYSEL;
    EDIS;
}

//*****************************************************************************
//
//! Set Valley delay values.
//!
//! \param base is the base address of the EPWM module.
//! \param delayOffsetValue is the software defined delay offset value.
//!
//! This function sets the Valley delay value.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setValleySWDelayValue(uint32_t base,
                                              uint16_t delayOffsetValue)
{

    ASSERT(EPWM_isBaseValid(base));

    // Write to SWVDELVAL bits
    HWREGH(base + EPWM_O_SWVDELVAL) = delayOffsetValue;
}

//*****************************************************************************
//
//! Set Valley delay mode.
//!
//! \param base is the base address of the EPWM module.
//! \param delayMode is the Valley delay mode.
//!
//! This function sets the Valley delay mode values.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setValleyDelayDivider(uint32_t base,
                                            EPWM_ValleyDelayMode delayMode)
{

    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // Write to VDELAYDIV bits
    HWREGH(base + EPWM_O_VCAPCTL) =
         ((HWREGH(base + EPWM_O_VCAPCTL) & ~EPWM_VCAPCTL_VDELAYDIV_M) |
          ((uint16_t)delayMode << 7U));
    EDIS;
}

//*****************************************************************************
//
//! Get the valley edge status bit.
//!
//! \param base is the base address of the EPWM module.
//! \param edge is the start or stop edge.
//!
//! This function returns the status of the start or stop valley status
//! depending on the value of edge.
//! If a start or stop edge has occurred, the function returns true , if not it
//! returns false.
//!
//! \return Returns true if the specified edge has occurred,
//!         Returns false if the specified edge has not occurred.
//
//*****************************************************************************
static inline bool EPWM_getValleyEdgeStatus(uint32_t base,
                                            EPWM_ValleyCounterEdge edge)
{
    ASSERT(EPWM_isBaseValid(base));

    if((uint16_t)edge == EPWM_VALLEY_COUNT_START_EDGE)
    {
        // returns STARTEDGESTS status
        return(((HWREGH(base + EPWM_O_VCNTCFG) & EPWM_VCNTCFG_STARTEDGESTS) ==
                   EPWM_VCNTCFG_STARTEDGESTS ) ? true : false);
    }
    else
    {
        // returns STOPEDGESTS  status
        return(((HWREGH(base + EPWM_O_VCNTCFG) & EPWM_VCNTCFG_STOPEDGESTS) ==
                    EPWM_VCNTCFG_STOPEDGESTS) ? true : false);
    }
}

//*****************************************************************************
//
//! Get the Valley Counter value.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the valley time base count value which is captured
//! upon occurrence of the stop edge condition selected by
//! EPWM_setValleyTriggerSource() and by the stopCount variable of the
//! EPWM_setValleyTriggerEdgeCounts() function.
//!
//! \return Returns the valley base time count.
//
//*****************************************************************************
static inline uint16_t EPWM_getValleyCount(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    // Read VCNTVAL register
    return(HWREGH(base + EPWM_O_VCNTVAL));
}

//*****************************************************************************
//
//! Get the Valley delay value.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the hardware valley delay count.
//!
//! \return Returns the valley delay count.
//
//*****************************************************************************
static inline uint16_t EPWM_getValleyHWDelay(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    // Read HWVDELVAL  register
    return(HWREGH(base + EPWM_O_HWVDELVAL));
}

//*****************************************************************************
//
//! Enable Global shadow load mode.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables Global shadow to active load mode of registers.
//! The trigger source for loading shadow to active is determined by
//! EPWM_setGlobalLoadTrigger() function.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableGlobalLoad(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // shadow to active load is controlled globally
    HWREGH(base + EPWM_O_GLDCTL) |= EPWM_GLDCTL_GLD;
    EDIS;
}

//*****************************************************************************
//
//! Disable Global shadow load mode.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables Global shadow to active load mode of registers.
//! Loading shadow to active is determined individually.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableGlobalLoad(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    EALLOW;
    // shadow to active load is controlled individually
    HWREGH(base + EPWM_O_GLDCTL) &= ~EPWM_GLDCTL_GLD;
    EDIS;
}

//*****************************************************************************
//
//! Set the Global shadow load pulse.
//!
//! \param base is the base address of the EPWM module.
//! \param loadTrigger is the pulse that causes global shadow load.
//!
//! This function sets the pulse that causes Global shadow to active load.
//! Valid values for the loadTrigger parameter are:
//!
//!   - EPWM_GL_LOAD_PULSE_CNTER_ZERO              - load when counter is equal
//!                                                  to zero
//!   - EPWM_GL_LOAD_PULSE_CNTER_PERIOD            - load when counter is equal
//!                                                  to period
//!   - EPWM_GL_LOAD_PULSE_CNTER_ZERO_PERIOD       - load when counter is equal
//!                                                  to zero or period
//!   - EPWM_GL_LOAD_PULSE_SYNC                    - load on sync event
//!   - EPWM_GL_LOAD_PULSE_SYNC_OR_CNTER_ZERO      - load on sync event or when
//!                                                  counter is equal to zero
//!   - EPWM_GL_LOAD_PULSE_SYNC_OR_CNTER_PERIOD    - load on sync event or when
//!                                                  counter is equal to period
//!   - EPWM_GL_LOAD_PULSE_SYNC_CNTER_ZERO_PERIOD  - load on sync event or when
//!                                                  counter is equal to period
//!                                                  or zero
//!   - EPWM_GL_LOAD_PULSE_GLOBAL_FORCE            - load on global force
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setGlobalLoadTrigger(uint32_t base,
                                   EPWM_GlobalLoadTrigger loadTrigger)
{
    ASSERT(EPWM_isBaseValid(base));


    // set the Global shadow to active load pulse.
    EALLOW;
    HWREGH(base + EPWM_O_GLDCTL) =
               ((HWREGH(base + EPWM_O_GLDCTL) & ~EPWM_GLDCTL_GLDMODE_M) |
                ((uint16_t)loadTrigger << EPWM_GLDCTL_GLDMODE_S));
    EDIS;
}

//*****************************************************************************
//
//! Set the number of Global load pulse event counts
//!
//! \param base is the base address of the EPWM module.
//! \param prescaleCount is the pulse event counts.
//!
//! This function sets the number of Global Load pulse events that have to
//! occurred before a global load pulse is issued. Valid values for prescaleCount
//! range from 0 to 7. 0 being no event (disables counter), and 7 representing
//! 7 events.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setGlobalLoadEventPrescale(uint32_t base,
                                                      uint16_t prescaleCount)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(prescaleCount < 8U);
    // Set the number of counts that have to occur before
    // a load strobe is issued.
    EALLOW;

    HWREGH(base + EPWM_O_GLDCTL) =
                ((HWREGH(base + EPWM_O_GLDCTL) & ~EPWM_GLDCTL_GLDPRD_M) |
                 (prescaleCount << EPWM_GLDCTL_GLDPRD_S));
    EDIS;
}

//*****************************************************************************
//
//! Return the number of Global load pulse event counts
//!
//! \param base is the base address of the EPWM module.
//!
//! This function returns the number of Global Load pulse events that have
//! occurred. These pulse events are set by the EPWM_setGlobalShadowLoadPulse()
//! function.
//!
//! \return None.
//
//*****************************************************************************
static inline uint16_t EPWM_getGlobalLoadEventCount(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Return the number of events that have occurred.
    return((HWREGH(base + EPWM_O_GLDCTL) >> EPWM_GLDCTL_GLDCNT_S) & 0x7U);
}

//*****************************************************************************
//
//! Enable continuous global shadow to active load.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables global continuous shadow to active load. Register
//! load happens every time the event set by the
//! EPWM_setGlobalShadowLoadPulse() occurs.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableGlobalLoadOneShotMode(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Enable global continuous shadow to active load
    EALLOW;

    HWREGH(base + EPWM_O_GLDCTL) &= ~EPWM_GLDCTL_OSHTMODE;

    EDIS;
}

//*****************************************************************************
//
//! Enable One shot global shadow to active load.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables a one time global shadow to active load. Register
//! load happens every time the event set by the
//! EPWM_setGlobalShadowLoadPulse() occurs.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableGlobalLoadOneShotMode(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    // Enable global continuous shadow to active load
    EALLOW;

