gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/epwm.h
    HWREGH(base + EPWM_O_GLDCTL) |= EPWM_GLDCTL_OSHTMODE;

    EDIS;
}

//*****************************************************************************
//
//! Set One shot global shadow to active load pulse.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function sets a one time global shadow to active load pulse. The pulse
//! propagates to generate a load signal if any of the events set by
//! EPWM_setGlobalShadowLoadPulse() occur , if the one shot global shadow load
//! option is enabled with EPWM_enableOSTGlobalShadowLoad() and if global
//! shadow load mode is enabled with EPWM_setupGlobalShadowLoadMode().
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setGlobalLoadOneShotLatch(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));

    // Set a one shot Global shadow load pulse.
    HWREGH(base + EPWM_O_GLDCTL2) |= EPWM_GLDCTL2_OSHTLD;
}

//*****************************************************************************
//
//! Force a software One shot global shadow to active load pulse.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function forces a software a one time global shadow to active load
//! pulse.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_forceGlobalLoadOneShotEvent(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // Force a Software Global shadow load pulse.
    HWREGH(base + EPWM_O_GLDCTL2) |= EPWM_GLDCTL2_GFRCLD;
}

//*****************************************************************************
//
//! Enable a register to be loaded Globally.
//!
//! \param base is the base address of the EPWM module.
//! \param loadRegister is the register.
//!
//! This function enables the register specified by loadRegister to be globally
//! loaded.
//! Valid values for loadRegister are:
//!  - EPWM_GL_REGISTER_TBPRD_TBPRDHR  - Register TBPRD:TBPRDHR
//!  - EPWM_GL_REGISTER_CMPA_CMPAHR    - Register CMPA:CMPAHR
//!  - EPWM_GL_REGISTER_CMPB_CMPBHR    - Register CMPB:CMPBHR
//!  - EPWM_GL_REGISTER_CMPC           - Register CMPC
//!  - EPWM_GL_REGISTER_CMPD           - Register CMPD
//!  - EPWM_GL_REGISTER_DBRED_DBREDHR  - Register DBRED:DBREDHR
//!  - EPWM_GL_REGISTER_DBFED_DBFEDHR  - Register DBFED:DBFEDHR
//!  - EPWM_GL_REGISTER_DBCTL          - Register DBCTL
//!  - EPWM_GL_REGISTER_AQCTLA_AQCTLA2 - Register AQCTLA/A2
//!  - EPWM_GL_REGISTER_AQCTLB_AQCTLB2 - Register AQCTLB/B2
//!  - EPWM_GL_REGISTER_AQCSFRC        - Register AQCSFRC
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_enableGlobalLoadRegisters(uint32_t base,
                                                 uint16_t loadRegister)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(loadRegister < 0x0800U);
    // the register specified by loadRegister is loaded globally
    EALLOW;

    HWREGH(base + EPWM_O_GLDCFG) |= loadRegister;

    EDIS;
}

//*****************************************************************************
//
//! Disable a register to be loaded Globally.
//!
//! \param base is the base address of the EPWM module.
//! \param loadRegister is the register.
//!
//! This function disables the register specified by loadRegister from being
//! loaded globally. The shadow to active load happens as specified by the
//! register control
//! Valid values for loadRegister are:
//!  - EPWM_GL_REGISTER_TBPRD_TBPRDHR  - Register TBPRD:TBPRDHR
//!  - EPWM_GL_REGISTER_CMPA_CMPAHR    - Register CMPA:CMPAHR
//!  - EPWM_GL_REGISTER_CMPB_CMPBHR    - Register CMPB:CMPBHR
//!  - EPWM_GL_REGISTER_CMPC           - Register CMPC
//!  - EPWM_GL_REGISTER_CMPD           - Register CMPD
//!  - EPWM_GL_REGISTER_DBRED_DBREDHR  - Register DBRED:DBREDHR
//!  - EPWM_GL_REGISTER_DBFED_DBFEDHR  - Register DBFED:DBFEDHR
//!  - EPWM_GL_REGISTER_DBCTL          - Register DBCTL
//!  - EPWM_GL_REGISTER_AQCTLA_AQCTLA2 - Register AQCTLA/A2
//!  - EPWM_GL_REGISTER_AQCTLB_AQCTLB2 - Register AQCTLB/B2
//!  - EPWM_GL_REGISTER_AQCSFRC        - Register AQCSFRC
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableGlobalLoadRegisters(uint32_t base,
                                                   uint16_t loadRegister)
{
    ASSERT(EPWM_isBaseValid(base));
    ASSERT(loadRegister < 0x0800U);

    // the register specified by loadRegister is loaded by individual
    // register configuration setting
    EALLOW;

    HWREGH(base + EPWM_O_GLDCFG) &= ~loadRegister;

    EDIS;
}
//*****************************************************************************
//
//! Lock EALLOW protected register groups
//!
//! \param base is the base address of the EPWM module.
//! \param registerGroup is the EALLOW register groups.
//!
//! This functions locks the EALLOW protected register groups specified by
//! the registerGroup variable.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_lockRegisters(uint32_t base,
                                      EPWM_LockRegisterGroup registerGroup)
{
    ASSERT(EPWM_isBaseValid(base));

    // write the Key to EPWMLOCK register
    HWREG(base + EPWM_O_LOCK) =
            ((uint32_t)0xA5A50000U |((uint32_t)1U << (uint16_t)registerGroup));
}
//*****************************************************************************
//
//! Set emulation mode
//!
//! \param base is the base address of the EPWM module.
//! \param emulationMode is the emulation mode.
//!
//! This function sets the emulation behaviours of the time base counter. Valid
//! values for emulationMode are:
//!  - EPWM_EMULATION_STOP_AFTER_NEXT_TB    - Stop after next Time Base counter
//!                                               increment or decrement.
//!  - EPWM_EMULATION_STOP_AFTER_FULL_CYCLE - Stop when counter completes whole
//!                                               cycle.
//!  - EPWM_EMULATION_FREE_RUN               - Free run.
//!
//! \return None.
//
//*****************************************************************************
extern void EPWM_setEmulationMode(uint32_t base,
                                  EPWM_EmulationMode emulationMode);

//*****************************************************************************
//
//! Registers ePWM interrupt handler
//!
//! \param base is the base address of the ePWM instance used.
//! \param handler is a pointer to the function to be called when the
//! serial peripheral interface interrupt occurs.
//!
//! This function registers the handler to be called when an ePWM interrupt
//! occurs.  This function enables the global interrupt in the interrupt
//! controller.
//! Specific ePWM interrupts must be enabled via EPWM_enableInterrupt().
//! If necessary, it is the interrupt handler's responsibility
//! to clear the interrupt source via EPWM_clearInterrupt().
//!
//! \sa Interrupt_register() for important information about registering
//!     interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void EPWM_registerInterrupt(uint32_t base,
                                                 void (*handler)(void));

//*****************************************************************************
//
//! Registers Trip Zone interrupt handler
//!
//! \param base is the base address of the ePWM instance used.
//! \param handler is a pointer to the function to be called when the
//! serial peripheral interface interrupt occurs.
//!
//! This function registers the handler to be called when a Trip Zone interrupt
//! occurs.  This function enables the global interrupt in the interrupt
//! controller.
//!
//! \sa Interrupt_register() for important information about registering
//!     interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void EPWM_registerTripZoneInterrupt(uint32_t base,
                                                        void (*handler)(void));

//*****************************************************************************
//
//! Un-registers ePWM interrupt handler.
//!
//! \param base is the base address of the ePWM instance used.
//!
//! This function clears the handler to be called when an ePWM interrupt
//! occurs.  This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler no longer is called.
//!
//! \sa Interrupt_register() for important information about registering
//!     interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void EPWM_unregisterInterrupt(uint32_t base);

//*****************************************************************************
//
//! Un-registers Trip Zone interrupt handler.
//!
//! \param base is the base address of the ePWM instance used.
//!
//! This function clears the handler to be called when a Trip Zone interrupt
//! occurs.  This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler no longer is called.
//!
//! \sa Interrupt_register() for important information about registering
//!     interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void EPWM_unregisterTripZoneInterrupt(uint32_t base);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __EPWM_H__
